// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтраницу(Элемент, ИмяСтраницы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
	КонецЕсли;
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции
//------------------------------------------------------
&НаКлиенте
Функция ОбновитьКонтент(Кэш) Экспорт
// Функция обновляет данные в главном окне при переходе в раздел Сервис	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "Сервис");
	// << alo
	Если ГлавноеОкно.Таблица_Сервис.количество()=0 И кэш.ини.свойство("Сервис") Тогда
		ИниСервис = Кэш.ФормаНастроек.Ини(Кэш, "Сервис");
		Для Каждого пунктКоманды Из ИниСервис Цикл
			Если ТипЗнч(пунктКоманды.значение)=Тип("Структура") И пунктКоманды.значение.Свойство("Имя") Тогда
				новыйПунктКоманды= ГлавноеОкно.Таблица_Сервис.добавить();
				новыйПунктКоманды.Ключ= пунктКоманды.Ключ;
				новыйПунктКоманды.Имя= пунктКоманды.значение.Имя;
				новыйПунктКоманды.Описание= пунктКоманды.значение.Описание;
				новыйПунктКоманды.Команда= пунктКоманды.значение.значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
// alo >>
	
	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура НаСменуРаздела(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисЭлементФормы(ГлавноеОкно,"ПанельТулбар").Видимость = Ложь;
	Контент = сбисЭлементФормы(ГлавноеОкно, "Контент");
	Контент.ТекущаяСтраница = сбисПолучитьСтраницу(Контент, "Сервис");	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт
КонецПроцедуры
&НаКлиенте
Процедура НавигацияУстановитьПанель(Кэш) Экспорт
// Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисЭлементФормы(ГлавноеОкно,"ПанельНавигации").Видимость=Ложь;
КонецПроцедуры	
