&НаКлиенте
Перем Кэш;

&НаКлиенте
Процедура Показать(ЛокальныйКэш, ПараметрыСообщения) Экспорт
	// Функция открывает окно сопоставления документов и заполняет все реквизиты на форме	
	Если ЛокальныйКэш.ТихийРежим Тогда
		Возврат;
	КонецЕсли;
	
	ПредупреждениеАдресСсылка	= ?(ПараметрыСообщения.Свойство("АдресСсылка"), ПараметрыСообщения.АдресСсылка, "");
	ПредупреждениеСсылка		= ?(ПараметрыСообщения.Свойство("ТекстСсылка"), ПараметрыСообщения.ТекстСсылка, "");
	ПредупреждениеТекст			= ПараметрыСообщения.Текст;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьМодально();
	#Иначе
		Открыть();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеСсылкаНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ПредупреждениеАдресСсылка);
КонецПроцедуры

