&НаКлиенте
Перем МестныйКэш Экспорт;
// функции для совместимости кода 
&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции
&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции
&НаКлиенте
Процедура сбисПоказатьСостояние(ТекстСостояния, Форма = Неопределено, Индикатор = Неопределено, Пояснение = "")
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Состояние(ТекстСостояния,Индикатор,Пояснение);
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Истина;
		Форма.НадписьОжидания = Символы.ПС + ТекстСостояния;
		Форма.НадписьПояснение = Пояснение;
		Если Индикатор<>Неопределено Тогда
			Форма.ЭлементыФормы.Индикатор.Видимость = Истина;
			Форма.ЭлементыФормы.Индикатор.Значение = Индикатор;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура сбисСпрятатьСостояние(Форма = Неопределено)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
	Иначе
		Форма.ЭлементыФормы.ПанельОжидания.Видимость = Ложь;
		Форма.ЭлементыФормы.Индикатор.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
//------------------------------------------------------

&НаКлиенте
Процедура ОтправитьДокументы(Кэш,МассивСтрок) Экспорт
// Процедура формирует и отправляет пакеты документов по отмеченным строкам в реестре	
	МестныйКэш = Кэш;
	Если Кэш.Свойство("ПарольПользователя1С") Тогда
		ОтправитьДокументыПослеВводаПароля(Кэш.ПарольПользователя1С, Новый Структура("Кэш,МассивСтрок", Кэш, МассивСтрок));
	Иначе
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ОтправитьДокументыПослеВводаПароля",ЭтаФорма, Новый Структура("Кэш,МассивСтрок", Кэш, МассивСтрок)),"", "Пароль пользователя "+ИмяПользователя());
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьДокументыПослеВводаПароля(ПарольПользователя1С, ДополнительныеПараметры) Экспорт
// Процедура формирует и отправляет пакеты документов по отмеченным строкам в реестре	
	Если ПарольПользователя1С = Неопределено Тогда
		Возврат
	КонецЕсли;
	Кэш = ДополнительныеПараметры.Кэш;
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	Кэш.Вставить("ПарольПользователя1С",ПарольПользователя1С);
	МестныйКэш = Кэш;
	сбисСформироватьИни(Кэш);
	Если СформироватьПотокиОтправки(Кэш) = Ложь Тогда
		Возврат;
	КонецЕсли;
	Всего = МассивСтрок.Количество();
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РезультатОтправки = Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0, Новый Соответствие,0,0,Новый Массив,0,Кэш.КоличествоПотоковОтправки,0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие);
	Кэш.Вставить("РезультатОтправки",РезультатОтправки);
	Кэш.РезультатОтправки.ВсегоПакетов = Всего;
	счСтрок = 0;
	ПодключитьОбработчикОжидания("ПрерываниеПользователемОтправкиДокументов",0.1,Истина);
	Для Каждого СтрокаСпискаДокументов Из МассивСтрок Цикл //Отправляемые пакеты
		сбисПоказатьСостояние("Отправка электронных документов",Кэш.ГлавноеОкно,Мин(100,Окр(счСтрок*100/Всего)), "(прервать -  Ctrl+Break)");
		СписокИдентификаторов = сбисПолучитьИдентификаторыДокументов1С(СтрокаСпискаДокументов.Значение.СоставПакета);
		СоставПакета = Новый Структура;
		СоставПакета.Вставить("Документы1С", СтрокаСпискаДокументов.Значение.СоставПакета);
		Док = Новый Массив;
		Док.Добавить(СписокИдентификаторов[0].Значение);
		Док.Добавить(СписокИдентификаторов[0].Представление);
		СтруктураВложений = Новый Структура("_type,d,s","recordset", Новый Массив, Новый Массив);
		СтруктураВложений.s.Добавить(Новый Структура("n,t","Идентификатор","Строка"));
		СтруктураВложений.s.Добавить(Новый Структура("n,t","ИдентификаторИС","Строка"));
		Для Каждого Ид Из СписокИдентификаторов Цикл
			Вложение = Новый Массив;
			Вложение.Добавить(Ид.Значение);
			Вложение.Добавить(Ид.Значение);
			СтруктураВложений.d.Добавить(Вложение);
		КонецЦикла;
		Док.Добавить(СтруктураВложений);
		СоставПакета.Вставить("МассивДляОтправки", Док);
		ОтправитьДокументВСвободныйПоток(Кэш, СоставПакета);
		счСтрок = счСтрок+1;
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	ОтключитьОбработчикОжидания("ПрерываниеПользователемОтправкиДокументов");
	сбисПолучитьОтветыПоОтправке(Кэш);
	ЗакрытьПотокиОтправки(Кэш);
	
	Кэш.РезультатОтправки.НеОтправлено = Кэш.РезультатОтправки.ВсегоПакетов-Кэш.РезультатОтправки.Отправлено+Кэш.РезультатОтправки.ОшибкиДоОтправки;
	Если Не Кэш.ТихийРежим Тогда
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьРезультатОтправки","ФормаРезультатОтправки","", Кэш);
		фрм.ПоказатьРезультатОтправки(Кэш);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПрерываниеПользователемОтправкиДокументов()
// Если пользователь прервал формирование документов, прячем состояние
	сбисПолучитьОтветыПоОтправке(МестныйКэш);
	ЗакрытьПотокиОтправки(МестныйКэш);	
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьДокументВСвободныйПоток(Кэш, СоставПакета)
	Если Кэш.РезультатОтправки.КоличествоСвободныхПотоков>0 Тогда
		Для Каждого Поток Из Кэш.СБИСПлагинПотоки Цикл
			Если Поток.Загружен=Ложь Тогда
				СБИСПлагин_sendDocument(Кэш, Поток, СоставПакета);
				Поток.Загружен = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;	
	Иначе
		Пока Истина Цикл
			Ответы = СБИСПлагин_ПолучитьОтветыSendDocument(Кэш, 0);
			КолОтветов = Ответы.Количество();
			Если КолОтветов>0 Тогда
				Для Каждого Поток Из Кэш.СБИСПлагинПотоки Цикл
					Если Поток.Загружен=Ложь Тогда
						СБИСПлагин_sendDocument(Кэш, Поток, СоставПакета);
						Поток.Загружен = Истина;
						Возврат;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если Кэш.НеобработанныеОтветыОтправки.Количество()>0 Тогда
					сбисЗаписатьСтатусыПоОтправленнымДокументам(Кэш);
				Иначе
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
&НаКлиенте
Функция СБИСПлагин_sendDocument(Кэш, Поток, СоставПакета)
	Парам = Новый Массив;
	Парам.Добавить(Кэш.Текущий.ТипДок);            //
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("s", Кэш.СписокДокументовS);	
	СтруктураДокумента.Вставить("d", СоставПакета.МассивДляОтправки);
	Парам.Добавить(СтруктураДокумента);
	Парам.Добавить("false");
	Кэш.РезультатОтправки.ПорНомер = Кэш.РезультатОтправки.ПорНомер + 1;
	ИдентификаторОтправки = строка(Кэш.РезультатОтправки.ПорНомер)+"_"+строка(ТекущаяДата());
	Кэш.РезультатОтправки.ДетализацияОтправки.Вставить(ИдентификаторОтправки, Новый Структура("ДатНач, ВремяВыполнения",ТекущаяУниверсальнаяДатаВМиллисекундах()));
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "sendDocument", Парам, ИдентификаторОтправки);	
	
	Статусы = Новый Массив;
	//Для Каждого Документ1С Из СоставПакета.Документы1С Цикл
	//	СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", СоставПакета.Идентификатор,Вложение.Идентификатор,);
	//	Статусы.Добавить(Новый Структура("СтруктураСвойств, Документ1С", СтруктураСвойств, Документ1С.Значение));
	//КонецЦикла;
	ОсновнойДокумент1С = СоставПакета.Документы1С[0].Значение;
	Кэш.РезультатОтправки.ДанныеПоСтатусам.Добавить(Новый Структура("Идентификатор, ОсновнойДокумент1С, Статусы",ИдентификаторОтправки, ОсновнойДокумент1С, Статусы));
	Кэш.РезультатОтправки.КоличествоСвободныхПотоков = Кэш.РезультатОтправки.КоличествоСвободныхПотоков-1;
КонецФункции
&НаКлиенте
Процедура сбисПолучитьОтветыПоОтправке(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	сбисПоказатьСостояние("Ожидание ответов", ГлавноеОкно);
	Пока Кэш.РезультатОтправки.ПолученоОтветов < Кэш.РезультатОтправки.ПорНомер Цикл
		Ответы = СБИСПлагин_ПолучитьОтветыSendDocument(Кэш, 60);
		сбисЗаписатьСтатусыПоОтправленнымДокументам(Кэш);
		КолОтветов = Ответы.Количество();
		Если КолОтветов = 0 Тогда    //   не все ответы получены, но больше ничего не приходит
			фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументовСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
			// << alo 
			Если Кэш.парам.СостояниеЭД Тогда
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("ИмяФункции",	"ЗаписатьПараметрыДокументовСБИС");
				ПараметрыПоиска.Вставить("КлючФорм",	"Статусы_СостоянияЭД");
				фрмЭД = Кэш.ОбщиеФункции.сбисНайтиФормуФункцииПодсистемы(Кэш, ПараметрыПоиска);
			КонецЕсли;
			// alo >>
			ИндексыДляУдаления = Новый СписокЗначений;
			ДанныеПоСтатусам = Новый Массив;
			// записываем ошибку в статус
			сч = 0;
			Для Каждого Элемент Из Кэш.РезультатОтправки.ДанныеПоСтатусам Цикл
				
				ДокументСБИС_Статус = "Ошибка: не получен ответ.";
				ДобавитьОшибкуВРезультатОтправки(Кэш, "Ошибка: не получен ответ.", Элемент);
				
				Для Каждого Стр Из Элемент.Статусы Цикл
					СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", Стр.СтруктураСвойств.ДокументСБИС_Ид, Стр.СтруктураСвойств.ДокументСБИС_ИдВложения, ДокументСБИС_Статус);
					ДанныеПоСтатусам.Добавить(Новый Структура("СтруктураСвойств, Документ1С",СтруктураСвойств, Стр.Документ1С));
				КонецЦикла;
				ИндексыДляУдаления.Добавить(сч);
				Кэш.РезультатОтправки.ПолученоОтветов = Кэш.РезультатОтправки.ПолученоОтветов+1;
				сч = сч+1;
			КонецЦикла;
			фрм.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.КаталогНастроек);
			// << alo 
			если Кэш.парам.СостояниеЭД тогда
				фрмЭД.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.КаталогНастроек);
			конецесли;	// alo >>
			КоличествоОтветовПоТекущейОтправке = ИндексыДляУдаления.Количество();
			// удаляем из кэша записанные статусы
			ИндексыДляУдаления.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
			Для Каждого Элемент Из ИндексыДляУдаления Цикл
				Кэш.РезультатОтправки.ДанныеПоСтатусам.Удалить(Элемент.Значение);		
			КонецЦикла;
			
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	сбисСпрятатьСостояние(ГлавноеОкно);
КонецПроцедуры
&НаКлиенте
Функция сбисЗаписатьСтатусыПоОтправленнымДокументам(Кэш) Экспорт
	// записываем статусы из полученных ответов
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗаписатьПараметрыДокументовСБИС",Кэш.ФормаРаботыСоСтатусами,"",Кэш);
	ИндексыДляУдаления = Новый СписокЗначений;
	ДанныеПоСтатусам = Новый Массив;
	//Сообщить("сбисЗаписатьСтатусыПоОтправленнымДокументам Кэш.НеобработанныеОтветыОтправки "+строка(Кэш.НеобработанныеОтветыОтправки.Количество()));
	Для каждого Сообщение Из Кэш.НеобработанныеОтветыОтправки Цикл
		ИдентификаторОтправки = РазложитьСтрокуВМассивПодстрок(Сообщение["queryID"],"@")[2];	
		сч = 0;
		Для Каждого Элемент Из Кэш.РезультатОтправки.ДанныеПоСтатусам Цикл
			Если Элемент.Идентификатор = ИдентификаторОтправки Тогда
				
				Если Сообщение["answer"].Свойство("error") Тогда
					ДокументСБИС_Статус = "Ошибка: "+Лев(Сообщение["answer"]["error"], 230);
					ДобавитьОшибкуВРезультатОтправки(Кэш, Сообщение["answer"]["error"], Элемент);
					
				Иначе
					Если Сообщение["answer"].Свойство("Состояние") Тогда
						Кэш.РезультатОтправки.Отправлено = Кэш.РезультатОтправки.Отправлено + 1;
						ДокументСБИС_Статус = Сообщение["answer"]["Состояние"];
					Иначе
						ДокументСБИС_Статус = "Ошибка: В ответе отсутствует состояние документа.";
						ДобавитьОшибкуВРезультатОтправки(Кэш, "В ответе отсутствует состояние документа", Элемент);
					КонецЕсли;
				КонецЕсли;
				
				Для Каждого Стр Из Элемент.Статусы Цикл
					СтруктураСвойств = Новый Структура("ДокументСБИС_Ид,ДокументСБИС_ИдВложения,ДокументСБИС_Статус", Стр.СтруктураСвойств.ДокументСБИС_Ид, Стр.СтруктураСвойств.ДокументСБИС_ИдВложения, ДокументСБИС_Статус);
					
					ДанныеПоСтатусам.Добавить(Новый Структура("СтруктураСвойств, Документ1С",СтруктураСвойств, Стр.Документ1С));
				КонецЦикла;
				ИндексыДляУдаления.Добавить(сч);
				Кэш.РезультатОтправки.ПолученоОтветов = Кэш.РезультатОтправки.ПолученоОтветов+1;
			КонецЕсли;
			сч = сч+1;
		КонецЦикла;
	КонецЦикла;
	Кэш.НеобработанныеОтветыОтправки = Новый Массив; // очищаем массив необработанных ответов
	//ДатаНач = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//фрм.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.КаталогНастроек);
	//// << alo 
	//если Кэш.парам.СостояниеЭД тогда
	//	фрмЭД.ЗаписатьПараметрыДокументовСБИС(ДанныеПоСтатусам, Кэш.Ини.Конфигурация, Кэш.ГлавноеОкно.КаталогНастроек);
	//конецесли;	// alo >>
	//ДатаКнц = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//Кэш.РезультатОтправки.ВремяЗаписиСтатусов = Кэш.РезультатОтправки.ВремяЗаписиСтатусов+(ДатаКнц-ДатаНач)/1000;
	КоличествоОтветовПоТекущейОтправке = ИндексыДляУдаления.Количество();
	// удаляем из кэша записанные статусы
	ИндексыДляУдаления.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	//Сообщить("сбисЗаписатьСтатусыПоОтправленнымДокументам Кэш.РезультатОтправки.ДанныеПоСтатусам "+строка(Кэш.РезультатОтправки.ДанныеПоСтатусам.Количество()));
	//Сообщить("сбисЗаписатьСтатусыПоОтправленнымДокументам ИндексыДляУдаления "+строка(ИндексыДляУдаления.Количество()));
	Для Каждого Элемент Из ИндексыДляУдаления Цикл
		Кэш.РезультатОтправки.ДанныеПоСтатусам.Удалить(Элемент.Значение);		
	КонецЦикла;
	Возврат КоличествоОтветовПоТекущейОтправке
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ПолучитьОтветыSendDocument(Кэш, ОжиданиеОтвета)
	ОтветыРезультат = Новый Массив;
	Если Кэш.СБИСПлагинНеобработанныеОтветы.Свойство("sendDocument") и Кэш.СБИСПлагинНеобработанныеОтветы.sendDocument.Количество()>0 Тогда
		сбисЗаписатьСтатистикуПоОтправке(Кэш, Кэш.СБИСПлагинНеобработанныеОтветы.sendDocument, ОтветыРезультат);
		Кэш.СБИСПлагинНеобработанныеОтветы.sendDocument.Очистить();
	КонецЕсли; 
	
	НачДата = ТекущаяДата();
	
	Пока ТекущаяДата() - ОжиданиеОтвета < НачДата или ОжиданиеОтвета = 0 Цикл
		Ответы = Новый Массив;
		ДатаНач = ТекущаяУниверсальнаяДатаВМиллисекундах();
		КолСообщений = СБИСПлагин_ПолучитьСообщения(Ответы, Кэш, "sendDocument");
		Если КолСообщений = 0 Тогда
			ДатаКнц = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Кэш.РезультатОтправки.ВремяОжиданияОтвета = Кэш.РезультатОтправки.ВремяОжиданияОтвета+(ДатаКнц-ДатаНач)/1000;
		Иначе
			сбисЗаписатьСтатистикуПоОтправке(Кэш, Ответы, ОтветыРезультат);
		КонецЕсли;
		Если ОтветыРезультат.Количество()>0 и КолСообщений=0 Тогда    // в предыдущий проход получили ответы, а в текущий уже нет - прерываемся
			Прервать;	
		КонецЕсли;
		Если ОжиданиеОтвета = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Сообщить("Ответов " + строка(ОтветыРезультат.Количество()) + " Кэш.НеобработанныеОтветыОтправки "+строка(Кэш.НеобработанныеОтветыОтправки.Количество()));
	Возврат ОтветыРезультат;
КонецФункции
&НаКлиенте
Функция сбисЗаписатьСтатистикуПоОтправке(Кэш, Ответы, ОтветыРезультат)
	Кэш.РезультатОтправки.КоличествоСвободныхПотоков = Кэш.РезультатОтправки.КоличествоСвободныхПотоков + Ответы.Количество();
	Для Каждого Ответ Из Ответы Цикл
		Кэш.НеобработанныеОтветыОтправки.Добавить(Ответ);
		ОтветыРезультат.Добавить(Ответ);
		ИдентификаторКоманды = РазложитьСтрокуВМассивПодстрок(Ответ["queryID"],"@");
		ИдентификаторОтправки = ИдентификаторКоманды[2];
		ИдентификаторПотока = ИдентификаторКоманды[1];
		Для Каждого Поток Из Кэш.СБИСПлагинПотоки Цикл
			Если Поток.objectID = ИдентификаторПотока Тогда
				Поток.Загружен = Ложь;
			КонецЕсли;
		КонецЦикла;

		ДетализацияОтправки = Кэш.РезультатОтправки.ДетализацияОтправки.Получить(ИдентификаторОтправки);
		Если ДетализацияОтправки<>Неопределено Тогда
			ДатКнц = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ДетализацияОтправки.ВремяВыполнения = (ДатКнц - ДетализацияОтправки.ДатНач)/1000;
			Кэш.РезультатОтправки.ВремяОтправки = Кэш.РезультатОтправки.ВремяОтправки+ДетализацияОтправки.ВремяВыполнения;
		КонецЕсли;
	КонецЦикла;
КонецФункции
// Формирование потоков отправки
&НаКлиенте
Функция СформироватьПотокиОтправки(Кэш)
	Если НЕ Кэш.Свойство("СБИСПлагин") Тогда
		СБИСПлагин = Новый COMОбъект("Tensor.SbisPluginClientCOM");
		СБИСПлагин.Connect();
		ОжиданиеОтвета = 5;
		НачДата = ТекущаяДата();
		Статус = СБИСПлагин.State();
		
		Пока Статус = "Connecting" ИЛИ Статус =  "Closed"  Цикл
			Статус = СБИСПлагин.State();
			Сообщить(Статус);
			Если ТекущаяДата() - ОжиданиеОтвета > НачДата Тогда
				Сообщить("не сумели подключиться к сбис плагину за разумное время");
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Кэш.Вставить("СБИСПлагин", СБИСПлагин);
	КонецЕсли;
	Количество = Кэш.КоличествоПотоковОтправки;   
	ДатаНач = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Потоки = Новый Массив;
	счетчик = 0;
	Попытка
		Пока Количество > счетчик Цикл			
			счетчик = счетчик + 1;
			Поток = Новый Структура();
			Поток.Вставить("Название", Строка(счетчик) + "Поток отправки ");
			СформироватьПотокОтправки(Поток, Кэш);
			Если Поток.Свойство("Загружен") Тогда
				Потоки.Добавить(Поток);
				Сообщить("СФОРМИРОВАН ПОТОК ОТПРАВКИ С ИДЕНТИФИКАТОРОМ: " + Поток.objectID);	           
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	ДатаКнц = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("Формирование потоков отправки "+строка((ДатаКнц-ДатаНач)/1000));
	Кэш.Вставить("СБИСПлагинПотоки", Потоки);
	Кэш.Вставить("СписокДокументовS", сбисСформироватьОписаниеСпискаДокументов());
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция СформироватьПотокОтправки(Поток, Кэш)
	СБИСПлагинВыполнить_getPlugin(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "getPlugin");
	Если Ответы.Количество() = 0 Тогда
		Сообщить("Не удалось получить расширение ExtCom1C. Возможно СБИС плагин не запущен.");
		Возврат "Не удалось получить расширение ExtCom1C. Возможно СБИС плагин не запущен.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	Поток.Вставить("objectID", Ответы[0]["answer"]["objectID"]);
	
	СБИСПлагинВыполнить_getConnection(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "getConnection");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод getConnection отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	Поток.Вставить("objectID", Ответы[0]["answer"]["objectID"]);
	
	СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setConnectionInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setConnectionInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_login(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "login");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод login отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setConnectionInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setConnectionInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	СБИСПлагинВыполнить_setSystemInfo(Кэш, Поток);
	Ответы = СБИСПлагин_ПолучитьОтветы(Кэш, "setSystemInfo");
	Если Ответы.Количество() = 0 Тогда
		Возврат "Метод setSystemInfo отработал не корректно. Не получен ответ.";
	КонецЕсли;
	Если Ответы[0]["answer"].Свойство("error") Тогда
		сбисСообщитьОбОшибке(Кэш, Ответы[0]["answer"]["error"]);
		Возврат Ответы[0]["answer"]["error"];
	КонецЕсли;
	
	Поток.Вставить("Загружен", Ложь);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_getPlugin(Кэш, Поток)
	Парам = Новый Массив;
	Парам.Добавить("ExtCom1C");
	Парам.Добавить("1.0.1.1");
	Парам.Добавить(NULL);
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "getPlugin", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_getConnection(Кэш, Поток)
	Парам = Новый Массив;	
	Параметр = Новый Структура();
	Параметр.Вставить("url", СтрЗаменить(СтрЗаменить(СтрокаСоединенияИнформационнойБазы(),"\","\\"),"""","\"""));    //   "File="C:\\Bronfeld\\Базы 8.3\\Buh3_test";"
	Параметр.Вставить("type", "IntEngineCom1S83");
	Параметр.Вставить("id", Поток.Название);
	
	Парам.Добавить(Параметр);	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "getConnection", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_setConnectionInfo(Кэш, Поток)
	Парам = Новый Массив;
	Параметр = Новый Структура();
	Параметр.Вставить("url", СтрЗаменить(СтрЗаменить(СтрокаСоединенияИнформационнойБазы(),"\","\\"),"""","\"""));
	Параметр.Вставить("type", "IntEngineCom1S83");
	Параметр.Вставить("ini", Кэш.СБИСПлагинИни);
	Параметр.Вставить("AccountID",Лев(Кэш.Парам.ИдентификаторСессии,8)+"@"+СтрЗаменить(Кэш.СБИС.АдресСервера,"https://",""));  
	Параметр.Вставить("sid",Кэш.Парам.ИдентификаторСессии);
	Параметр.Вставить("host",Кэш.СБИС.АдресСервера);
	Парам.Добавить(Параметр);
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "setConnectionInfo", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_login(Кэш, Поток)
	Парам = Новый Массив;
	Парам.Добавить(ИмяПользователя());
	Парам.Добавить(Кэш.ПарольПользователя1С); 
	
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "login", Парам);
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_setSystemInfo(Кэш, Поток)
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "setSystemInfo");
КонецФункции
&НаКлиенте
Функция ЗакрытьПотокиОтправки(Кэш)
	Для Каждого Поток Из Кэш.СБИСПлагинПотоки Цикл
		СБИСПлагинВыполнить_logout(Кэш, Поток)	
	КонецЦикла;
	Возврат Истина;
КонецФункции
&НаКлиенте
Функция СБИСПлагинВыполнить_logout(Кэш, Поток)
	Парам = Новый Массив;
	СБИСПлагин_ВыполнитьМетод(Кэш, Поток, "logout", Парам);
КонецФункции

//-----------------------------------------------


&НаКлиенте
Функция СБИСПлагин_ВыполнитьМетод(Кэш, Поток, Метод, Парам=Неопределено, Идентификатор = "")
	Сообщение = Новый Структура;
	Сообщение.Вставить("type", "call");
	Сообщение.Вставить("method", Метод);
	Сообщение.Вставить("queryID", Метод +"@"+?(Поток.Свойство("objectID"),Поток.objectID,"")+"@"+Идентификатор);
	
	Если Поток.Свойство("objectID") Тогда
		Сообщение.Вставить("objectID", Поток.objectID);
	КонецЕсли;
	
	Если Парам<>Неопределено Тогда
		Сообщение.Вставить("Params",Парам);
	КонецЕсли;
		
	Сообщение = "{"+сбисЗаписатьПараметрыЗапроса(Сообщение)+"}";	
	Если Кэш.СБИСПлагин.State() = "Open" Тогда
		Кэш.СБИСПлагин.Send(Сообщение);
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СБИСПлагин_ПолучитьОтветы(Кэш, Команда, ОжиданиеОтвета = 30, ПреобразовыватьДаты = Истина) Экспорт
	НачДата = ТекущаяДата();
	Результат = Новый Массив;
	
	Пока ТекущаяДата() - ОжиданиеОтвета < НачДата или ОжиданиеОтвета = 0 Цикл
		ПредКоличество = Результат.Количество();
		КолНужныхСообщений = СБИСПлагин_ПолучитьСообщения(Результат, Кэш, Команда, ПреобразовыватьДаты);
		Если Результат.Количество()>0 и КолНужныхСообщений=0 Тогда    // в предыдущий проход получили ответы, а в текущий уже нет - прерываемся
			Прервать;	
		КонецЕсли;
		Если ОжиданиеОтвета = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
&НаКлиенте
Функция СБИСПлагин_ПолучитьСообщения(Результат, Кэш, Команда, ПреобразовыватьДаты = Истина)
	
	Сообщения = Кэш.СБИСПлагин.ReadAll();
	КолСообщений = Сообщения.GetUpperBound(0);
	Первое = Сообщения.GetLowerBound(0);
	КолНужныхСообщений = 0;
	Если КолСообщений >= 0 Тогда
		//Сообщить(Команда+" "+строка(Первое)+" "+строка(КолСообщений));
		Для нпп = Первое По КолСообщений Цикл
			Сообщение = Сообщения.GetValue(нпп);
			Попытка
				Сообщение = Кэш.РаботаСJSON.сбисПрочитатьJSON(Сообщение);
				
				Если Сообщение.Свойство("event") И Сообщение["event"] <> "" Тогда
					event = Сообщение["event"];
					Сообщение = Кэш.РаботаСJSON.сбисПрочитатьJSON(Сообщение["event"],,, ПреобразовыватьДаты);
					
					ИдентификаторКоманды = Сообщение["queryID"];
					ВыполненнаяКоманда = РазложитьСтрокуВМассивПодстрок(ИдентификаторКоманды,"@")[0];
					
					Если ВыполненнаяКоманда = Команда Тогда
						Результат.Добавить(Сообщение);
						КолНужныхСообщений = КолНужныхСообщений + 1;
					ИначеЕсли ВыполненнаяКоманда = "sendDocument" Тогда
						Попытка
							Если НЕ Кэш.СБИСПлагинНеобработанныеОтветы.Свойство(ВыполненнаяКоманда) Тогда
								Кэш.СБИСПлагинНеобработанныеОтветы.Вставить(ВыполненнаяКоманда, Новый Массив);
							КонецЕсли;
							Кэш.СБИСПлагинНеобработанныеОтветы[ВыполненнаяКоманда].Добавить(Сообщение);
						Исключение
						КонецПопытки;
					КонецЕсли;
					
					
				КонецЕсли	
			Исключение
				//Сообщить(event);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Возврат КолНужныхСообщений;
КонецФункции
&НаКлиенте
Функция сбисЗаписатьПараметрыЗапроса(СтруктураПараметровЗапроса) Экспорт
	ТекстЗапроса = "";
	Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") ИЛИ ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":"""+?(Элемент.Ключ = "url",Элемент.Значение,СтрЗаменить(Элемент.Значение, """", "\"""))+""",";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":"""+строка(Элемент.Значение)+""",";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") или ТипЗнч(Элемент.Значение) = Тип("Соответствие") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":{"+сбисЗаписатьПараметрыЗапроса(Элемент.Значение)+"},";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			ТекстЗапроса = ТекстЗапроса+""""+Элемент.Ключ+""":[";
			Для Каждого ЭлементМассива Из Элемент.Значение Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Строка") ИЛИ ТипЗнч(ЭлементМассива) =  Тип("Дата") Тогда
					ТекстЗапроса = ТекстЗапроса+""""+СтрЗаменить(ЭлементМассива, """", "\""")+""",";
				ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Null") Тогда
					ТекстЗапроса = ТекстЗапроса+"{}";
				ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Массив") Тогда
					ТекстЗапроса = ТекстЗапроса+"[";
					Для Каждого Элемент Из ЭлементМассива Цикл
						Если ТипЗнч(Элемент) = Тип("Строка") ИЛИ ТипЗнч(Элемент) =  Тип("Дата") Тогда
							ТекстЗапроса = ТекстЗапроса+""""+СтрЗаменить(Элемент, """", "\""")+""",";
						ИначеЕсли ТипЗнч(Элемент) = Тип("Null") Тогда
							ТекстЗапроса = ТекстЗапроса+"{}";
						ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
							
						Иначе
							ТекстЗапроса = ТекстЗапроса+"{";
							ТекстЗапроса = ТекстЗапроса+сбисЗаписатьПараметрыЗапроса(Элемент);
							ТекстЗапроса = ТекстЗапроса+"},";
						КонецЕсли;
					КонецЦикла;
					Если Прав(ТекстЗапроса, 1) = "," Тогда
						ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса+"],";
				Иначе
					ТекстЗапроса = ТекстЗапроса+"{";
					ТекстЗапроса = ТекстЗапроса+сбисЗаписатьПараметрыЗапроса(ЭлементМассива);
					ТекстЗапроса = ТекстЗапроса+"},";
				КонецЕсли;
			КонецЦикла;
			Если Прав(ТекстЗапроса, 1) = "," Тогда
				ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса+"],";
		КонецЕсли;
	КонецЦикла;
	Если Прав(ТекстЗапроса, 1) = "," Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1);
	КонецЕсли;
	Возврат ТекстЗапроса; 	
КонецФункции
&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока 1=1 Цикл
		Поз = Найти(Стр,Разделитель);
		Если Поз=0 Тогда
			МассивСтрок.Добавить(Стр);
			Возврат МассивСтрок;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр,Поз-1));
		Стр = Сред(Стр,Поз+ДлинаРазделителя);
	КонецЦикла;
КонецФункции
&НаКлиенте
Функция сбисСформироватьОписаниеСпискаДокументов()
	СписокДокументовS = Новый Массив();
	СписокДокументовS.Добавить(Новый Структура("n,t","Идентификатор","Строка"));	
	СписокДокументовS.Добавить(Новый Структура("n,t","Название","Строка"));
	СписокДокументовS.Добавить(Новый Структура("n,t","Вложения","Выборка"));
	Возврат СписокДокументовS;
КонецФункции
Функция сбисПолучитьИдентификаторыДокументов1С(СоставПакета)
	СписокИдентификаторов = Новый СписокЗначений;
	Для Каждого Документ1С Из СоставПакета Цикл
		СписокИдентификаторов.Добавить(Документ1С.Значение.Метаданные().Имя+":"+строка(Документ1С.Значение.УникальныйИдентификатор()), строка(Документ1С.Значение));		
	КонецЦикла;
	Возврат СписокИдентификаторов;
КонецФункции
&НаКлиенте
Функция сбисСформироватьИни(Кэш)
	СБИСПлагинИни = "{""РеализацияТоваровУслуг"":{""Реестр1С_Тип"": {""Значение"": ""'РеализацияТоваровУслуг'""},""РеестрСБИС_ИдМеню"": {""Значение"": ""'OutBoxReadДокОтгрИсх,OutBoxReadИсходящие'""},""РеестрПоУмолчанию"": {""Значение"": ""'1'""},""ДокументРаздел"": {""Значение"": ""'Продажа'""},""мФайл"": {""ЭДОНакл"": [{""Значение"": ""'ЭДОНакл'"",""Имя"": ""Вложение_Тип""},{""Значение"": ""'1175004'"",""Имя"": ""Вложение_ПодТип""},{""Значение"": ""'5.01'"",""Имя"": ""Вложение_ВерсияФормата""},{""Значение"": ""'2015'"",""Имя"": ""Вложение_ПодВерсияФормата""},{""Значение"": ""'ЭДОНакл'"",""Имя"": ""Файл_Формат""},{""Значение"": ""'3.01'"",""Имя"": ""Файл_ВерсияФормата""},{""Значение"": ""'DP_OTORG12_'"",""Имя"": ""Файл_Имя""},{""Значение"": ""Документ.РеализацияТоваровУслуг"",""Имя"": ""Документ""},{""Значение"": ""'Отправитель'"",""Имя"": ""Отправитель_Роль""},{""Значение"": ""'Получатель'"",""Имя"": ""Получатель_Роль""},{""Значение"": ""'Накладная'"",""Имя"": ""Документ_Название""},{""Тип"": ""Дата"",""Формат"": ""ДФ=dd.MM.yyyy"",""Значение"": ""[Документ].Дата"",""Имя"": ""Документ_Дата""},{""Тип"": ""Дата"",""Формат"": ""ДФ=HH.mm.ss"",""Значение"": ""[Документ].Дата"",""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокумента()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                ""Имя"": ""СуммаВключаетНДС""
|            },
|            {
|                ""Значение"": ""Константа.ВалютаРегламентированногоУчета"",
|                ""Имя"": ""ВалютаУчета""
|            },
|            {
|                ""Значение"": ""[Документ].ВалютаДокумента"",
|                ""Имя"": ""Валюта""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""ПересчитатьВВалютеУчета""
|            },
|            {
|                ""Значение"": ""'1'"",
|                ""Имя"": ""КурсВзаиморасчетов""
|            },
|            {
|                ""Значение"": ""'1'"",
|                ""Имя"": ""КратностьВзаиморасчетов""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""СуммаДляПересчетаВключаетНДС""
|            },
|            {
|                ""Значение"": ""'Мы, нижеподписавшиеся, представитель ИСПОЛНИТЕЛЯ, с одной стороны и представитель ЗАКАЗЧИКА\n            с другой стороны, составили настоящий акт в том, что ИСПОЛНИТЕЛЬ выполнил, а ЗАКАЗЧИК принял следующие\n            работы (услуги)'"",
|                ""Имя"": ""Документ_Заголовок""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизическоеЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].ФИО"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Значение"": ""[Документ].ПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Значение"": ""'Реализация'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Имя"": ""мДокументОснование"",
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мПараметр"",
|                ""Значение"": {
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мСторона"",
|                ""Значение"": {
|                    ""Грузополучатель"": [
|                        {
|                            ""Значение"": ""[Документ].Грузополучатель"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Грузополучатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Грузополучатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Грузополучатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Грузоотправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Грузоотправитель"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Грузоотправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Грузоотправитель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Грузоотправитель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ],
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Имя"": ""ИП""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""АдресФЛ"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[ИП].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].АдресПоПропискеФизическиеЛица""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_АдресФЛ_XML""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].Представление"",
|                            ""Имя"": ""Сторона_АдресФЛ_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Имя"": ""Сертификат"",
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Имя"": ""мПредставитель"",
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            }
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мОснование"",
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                            ""Имя"": ""Основание""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Наименование"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Основание].Номер"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Основание].Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Значение"": ""Перечисление.ТабличныеЧастиДокументов"",
|                ""Имя"": ""ТабличныеЧастиДокументов""
|            },
|            {
|                ""Имя"": ""мТаблДок"",
|                ""Значение"": {
|                    ""Товары"": [
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Значение"": ""[Документ].Товары"",
|                            ""Имя"": ""ТаблДок""
|                        },
|                        {
|                            ""Отбор_Регистратор"": ""Документ"",
|                            ""Имя"": ""СуммыДокументовВВалютеРегл"",
|                            ""Отбор_ТабличнаяЧастьДокумента"": ""[ТабличныеЧастиДокументов].Товары"",
|                            ""Отбор_НомерСтрокиДокумента"": ""[ТаблДок].НомерСтроки"",
|                            ""Значение"": ""РегистрыСведений.РублевыеСуммыДокументовВВалюте""
|                        },
|                        {
|                            ""Значение"": ""[СуммыДокументовВВалютеРегл].Всего"",
|                            ""Имя"": ""CуммаДляПересчета""
|                        },
|                        {
|                            ""Значение"": ""[СуммыДокументовВВалютеРегл].НДС"",
|                            ""Имя"": ""CуммаНДСДляПересчета""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].ЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].НаименованиеПолное"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""ТаблДок_Описание""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Артикул"",
|                            ""Имя"": ""ТаблДок_Артикул""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].НомерГТД"",
|                            ""Имя"": ""НомерГТД""
|                        },
|                        {
|                            ""Имя"": ""мПараметр"",
|                            ""Значение"": {
|                                ""НомерГТД"": [
|                                    {
|                                        ""Значение"": ""'НомерГТД'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Значение"": ""[НомерГТД].Код"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            }
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтранаПроисхождения"",
|                            ""Имя"": ""СтранаПроисхождения""
|                        },
|                        {
|                            ""Значение"": ""[СтранаПроисхождения].Код"",
|                            ""Имя"": ""ТаблДок_Страна""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].ЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзмУпаковки""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=12; ЧДЦ=0; ЧРД=.; ЧГ=0;"",
|                            ""Значение"": ""[ТаблДок].Коэффициент"",
|                            ""Имя"": ""Упаковка_Вместимость""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзмУпаковки].Код"",
|                            ""Имя"": ""Упаковка_Код""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=12; ЧДЦ=0; ЧРД=.; ЧГ=0;"",
|                            ""Значение"": ""[ТаблДок].КоличествоМест"",
|                            ""Имя"": ""Упаковка_КолМест""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзмУпаковки].Наименование"",
|                            ""Имя"": ""Упаковка_Название""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ]
|                }
|            }
|        ],
|        ""АктВР"": [
|            {
|                ""Значение"": ""'АктВР'"",
|                ""Имя"": ""Вложение_Тип""
|            },
|            {
|                ""Значение"": ""'1175006'"",
|                ""Имя"": ""Вложение_ПодТип""
|            },
|            {
|                ""Значение"": ""'5.01'"",
|                ""Имя"": ""Вложение_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'2015'"",
|                ""Имя"": ""Вложение_ПодВерсияФормата""
|            },
|            {
|                ""Значение"": ""'АктВР'"",
|                ""Имя"": ""Файл_Формат""
|            },
|            {
|                ""Значение"": ""'3.01'"",
|                ""Имя"": ""Файл_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""'DP_IAKTPRM_'"",
|                ""Имя"": ""Файл_Имя""
|            },
|            {
|                ""Значение"": ""Документ.РеализацияТоваровУслуг"",
|                ""Имя"": ""Документ""
|            },
|            {
|                ""Значение"": ""'Отправитель'"",
|                ""Имя"": ""Отправитель_Роль""
|            },
|            {
|                ""Значение"": ""'Получатель'"",
|                ""Имя"": ""Получатель_Роль""
|            },
|            {
|                ""Значение"": ""'Акт выполненных работ'"",
|                ""Имя"": ""Документ_Название""
|            },
|            {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Значение"": ""[Документ].Дата"",
|                ""Имя"": ""Документ_Дата""
|            },
|            {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=HH.mm.ss"",
|                ""Значение"": ""[Документ].Дата"",
|                ""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокументаБезПрефикса()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""'Мы, нижеподписавшиеся, представитель ИСПОЛНИТЕЛЯ, с одной стороны и представитель ЗАКАЗЧИКА\n            с другой стороны, составили настоящий акт в том, что ИСПОЛНИТЕЛЬ выполнил, а ЗАКАЗЧИК принял следующие\n            работы (услуги)'"",
|                ""Имя"": ""Документ_Заголовок""
|            },
|            {
|                ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                ""Имя"": ""СуммаВключаетНДС""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизическоеЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].ФИО"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Значение"": ""[Документ].ПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Значение"": ""'Реализация'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Имя"": ""мДокументОснование"",
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мОснование"",
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""[Договор].Наименование"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мПараметр"",
|                ""Значение"": {
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""СуммаВключаетНДС"": [
|                        {
|                            ""Значение"": ""'СуммаВключаетНДС'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Документ].СуммаВключаетНДС"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мСторона"",
|                ""Значение"": {
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Имя"": ""ИП""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""АдресФЛ"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[ИП].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].АдресПоПропискеФизическиеЛица""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_АдресФЛ_XML""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].Представление"",
|                            ""Имя"": ""Сторона_АдресФЛ_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Имя"": ""Сертификат"",
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Имя"": ""мПредставитель"",
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            }
|                        }
|                    ],
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""''"",
|                            ""Имя"": ""Код_ОКДП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мТаблДок"",
|                ""Значение"": {
|                    ""Услуги"": [
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Значение"": ""[Документ].Услуги"",
|                            ""Имя"": ""ТаблДок""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].ЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""Описание""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].НаименованиеПолное"",
|                            ""Имя"": ""Название""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""{ПолучитьНаименованиеУслуги()}"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""ТаблДок_Описание""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Имя"": ""мПараметр"",
|                            ""Значение"": {
|                                ""Цена1С"": [
|                                    {
|                                        ""Значение"": ""'Цена1С'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                                        ""Значение"": ""[ТаблДок].Цена"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            }
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ],
|                    ""АгентскиеУслуги"": [
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Значение"": ""[Документ].АгентскиеУслуги"",
|                            ""Имя"": ""ТаблДок""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Номенклатура"",
|                            ""Имя"": ""Номенклатура""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].ЕдиницаИзмерения"",
|                            ""Имя"": ""ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""Описание""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].НаименованиеПолное"",
|                            ""Имя"": ""Название""
|                        },
|                        {
|                            ""Значение"": ""[Номенклатура].Код"",
|                            ""Имя"": ""ТаблДок_Код""
|                        },
|                        {
|                            ""Значение"": ""{ПолучитьНаименованиеУслуги()}"",
|                            ""Имя"": ""ТаблДок_Название""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Содержание"",
|                            ""Имя"": ""ТаблДок_Описание""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].Цена"",
|                            ""Имя"": ""Цена""
|                        },
|                        {
|                            ""Имя"": ""мПараметр"",
|                            ""Значение"": {
|                                ""Цена1С"": [
|                                    {
|                                        ""Значение"": ""'Цена1С'"",
|                                        ""Имя"": ""Параметр_Имя""
|                                    },
|                                    {
|                                        ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                                        ""Значение"": ""[ТаблДок].Цена"",
|                                        ""Имя"": ""Параметр_Значение""
|                                    }
|                                ]
|                            }
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧГ=0; ЧН=0.000"",
|                            ""Значение"": ""[ТаблДок].Количество"",
|                            ""Имя"": ""ТаблДок_Кол_во""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Наименование"",
|                            ""Имя"": ""ТаблДок_ЕдИзм""
|                        },
|                        {
|                            ""Значение"": ""[ЕдИзм].Код"",
|                            ""Имя"": ""ТаблДок_ОКЕИ""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].Сумма"",
|                            ""Имя"": ""ТаблДок_Сумма""
|                        },
|                        {
|                            ""Формат"": ""ЧЦ=17; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00"",
|                            ""Значение"": ""[ТаблДок].СуммаНДС"",
|                            ""Имя"": ""СуммаНДС""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].СтавкаНДС"",
|                            ""Имя"": ""СтавкаНДС""
|                        },
|                        {
|                            ""Значение"": ""{сбисВычислитьЦену()}"",
|                            ""Имя"": ""ТаблДок_Цена""
|                        },
|                        {
|                            ""Значение"": ""'без акциза'"",
|                            ""Имя"": ""СуммаАкциз""
|                        },
|                        {
|                            ""Значение"": ""{ОпределитьИдентификаторНоменклатуры()}"",
|                            ""Имя"": ""ТаблДок_Идентификатор""
|                        }
|                    ]
|                }
|            }
|        ]
|    },
|    ""РеестрСБИС_Тип"": {
|        ""Значение"": ""'ДокОтгрИсх,Исходящие'""
|    },
|    ""Реестр1С_Название"": {
|        ""Значение"": ""'Реализация товаров и услуг'""
|    },
|    ""СписокДокументов"": {
|        ""Данные"": {
|            ""Время"": {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=HH:mm"",
|                ""Значение"": ""'Дата'"",
|                ""Имя"": ""Время""
|            },
|            ""Организация"": {
|                ""Значение"": ""'Организация'"",
|                ""Имя"": ""Организация""
|            },
|            ""Идентификатор"": {
|                ""Значение"": ""'Ссылка'"",
|                ""Имя"": ""Идентификатор""
|            },
|            ""Комментарий"": {
|                ""Значение"": ""'Комментарий'"",
|                ""Имя"": ""Комментарий""
|            },
|            ""Дата"": {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Значение"": ""'Дата'"",
|                ""Имя"": ""Дата""
|            },
|            ""Вложения"": {
|                ""Имя"": ""Вложения"",
|                ""Значение"": {
|                    ""Подчиненные"": {
|                        ""СчетФактураВыданный"": ""'СчетФактураВыданный'""
|                    }
|                }
|            },
|            ""Валюта"": {
|                ""Значение"": ""'ВалютаДокумента'"",
|                ""Имя"": ""Валюта""
|            },
|            ""Контрагент"": {
|                ""Значение"": ""'Контрагент'"",
|                ""Имя"": ""Контрагент""
|            },
|            ""Номер"": {
|                ""Значение"": ""'Номер'"",
|                ""Имя"": ""Номер""
|            },
|            ""Сумма"": {
|                ""Значение"": ""'СуммаДокумента'"",
|                ""Имя"": ""Сумма""
|            },
|            ""Название"": {
|                ""Значение"": ""'Ссылка'"",
|                ""Имя"": ""Название""
|            }
|        }
|    },
|    ""Реестр1С_ВидимыеСтолбцы"": {
|        ""Значение"": ""'Отмечен,Проведен,Статус,Дата,Номер,Контрагент,Сумма,Организация,Комментарий,Склад'""
|    },
|    ""ЗапросСпискаДокументов"": {
|        ""Значение"": ""'ВЫБРАТЬ РАЗРЕШЕННЫЕ\n        РеализацияТоваровУслуг.Ссылка,\n        РеализацияТоваровУслуг.Проведен,\n        РеализацияТоваровУслуг.ПометкаУдаления,\n        РеализацияТоваровУслуг.Дата,\n        РеализацияТоваровУслуг.Номер,\n        РеализацияТоваровУслуг.Контрагент.Наименование КАК Контрагент,\n        РеализацияТоваровУслуг.Организация.Наименование КАК Организация,\n        РеализацияТоваровУслуг.Ответственный.Наименование КАК Ответственный,\n        ВЫРАЗИТЬ(РеализацияТоваровУслуг.Комментарий КАК СТРОКА(1000)) КАК Комментарий,\n        РеализацияТоваровУслуг.Склад.Наименование КАК Склад,\n        РеализацияТоваровУслуг.СуммаДокумента,\n        РеализацияТоваровУслуг.ВалютаДокумента.Наименование КАК Валюта,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю КАК Приложение,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаПриложения,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Дата КАК ДатаПриложения,\n        РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Номер КАК НомерПриложения\n        ПОМЕСТИТЬ ВТ_Реализация\n        ИЗ\n        Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов\n        ПО РеализацияТоваровУслуг.Контрагент = ЗначенияСвойствОбъектов.Объект И\n        ЗначенияСвойствОбъектов.Свойство.Наименование = \""СБИС_СпособДоставки\""\n        ГДЕ\n        ((РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон) ИЛИ (НЕ &ЗначениеДатаКонЗаполнено И\n        РеализацияТоваровУслуг.Дата > &ДатаНач))\n        И ((РеализацияТоваровУслуг.Контрагент = &Контрагент) ИЛИ (РеализацияТоваровУслуг.Контрагент В Иерархии(&Контрагент))\n        ИЛИ (НЕ &ЗначениеКонтрагентЗаполнено))\n        И ((РеализацияТоваровУслуг.Организация = &ТекущаяОрганизация) ИЛИ (НЕ &ЗначениеТекущаяОрганизацияЗаполнено))\n        И ((РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент) ИЛИ (НЕ &ЗначениеТекущийДокументЗаполнено))\n        И (&КонтрагентПодключен=\""\"" ИЛИ &КонтрагентПодключен=ЗначенияСвойствОбъектов.Значение.Наименование)\n        И (&Ответственный=Значение(Справочник.Пользователи.ПустаяСсылка) ИЛИ &Ответственный=РеализацияТоваровУслуг.Ответственный)\n        И НЕ РеализацияТоваровУслуг.ПометкаУдаления;\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n        ВТ_Реализация.Проведен КАК ДокументПроведен,\n        ВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n        ВТ_Реализация.Ответственный КАК Ответственный,\n        ВТ_Реализация.Комментарий КАК Комментарий,\n        ВТ_Реализация.Склад КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n        ВТ_Реализация.Валюта КАК Валюта,\n        ВТ_Реализация.Приложение КАК Приложение,\n        ВТ_Реализация.СуммаПриложения КАК СуммаПриложения,\n        ВТ_Реализация.ДатаПриложения КАК ДатаПриложения,\n        ВТ_Реализация.НомерПриложения КАК НомерПриложения,\n        ДополнительныеСведения.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения\n        ПО ВТ_Реализация.Ссылка = ДополнительныеСведения.Объект И ДополнительныеСведения.Свойство.Наименование =\n        \""ДокументСБИС_Статус\""\n        ГДЕ\n        НЕ ВТ_Реализация.Приложение = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)\n\n        ОБЪЕДИНИТЬ\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n        ВТ_Реализация.Проведен КАК ДокументПроведен,\n        ВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n        ВТ_Реализация.Ответственный КАК Ответственный,\n        ВТ_Реализация.Комментарий КАК Комментарий,\n        ВТ_Реализация.Склад КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n        ВТ_Реализация.Валюта КАК Валюта,\n        СвязьДокументов.Ссылка КАК Приложение,\n        СвязьДокументов.Ссылка.СуммаДокумента КАК СуммаПриложения,\n        СвязьДокументов.Ссылка.Дата КАК ДатаПриложения,\n        СвязьДокументов.Ссылка.Номер КАК НомерПриложения,\n        ДополнительныеСведения.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СвязьДокументов\n        ПО ВТ_Реализация.Ссылка = СвязьДокументов.ДокументОснование\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения\n        ПО ВТ_Реализация.Ссылка = ДополнительныеСведения.Объект И ДополнительныеСведения.Свойство.Наименование =\n        \""ДокументСБИС_Статус\""\n        УПОРЯДОЧИТЬ ПО\n        ДатаДокумента, НомерДокумента'""
|    }
|},
|""СчетФактураВыданный"":{
|    ""Реестр1С_Тип"": {
|        ""Значение"": ""'СчетФактураВыданный'""
|    },
|    ""РеестрСБИС_ИдМеню"": {
|        ""Значение"": ""'OutBoxReadФактураИсх,OutBoxReadДокОтгрИсх,OutBoxReadИсходящие'""
|    },
|    ""РеестрПоУмолчанию"": {
|        ""Значение"": ""'0'""
|    },
|    ""ДокументРаздел"": {
|        ""Значение"": ""'Продажа'""
|    },
|    ""мФайл"": {
|        ""СчФктр"": [
|            {
|                ""Значение"": ""{сбисФорматСФ()}"",
|                ""Имя"": ""Вложение_Тип""
|            },
|            {
|                ""Значение"": ""{сбисПодтипСФ()}"",
|                ""Имя"": ""Вложение_ПодТип""
|            },
|            {
|                ""Значение"": ""'5.02'"",
|                ""Имя"": ""Вложение_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""{сбисФорматСФ()}"",
|                ""Имя"": ""Файл_Формат""
|            },
|            {
|                ""Значение"": ""'3.01'"",
|                ""Имя"": ""Файл_ВерсияФормата""
|            },
|            {
|                ""Значение"": ""{сбисИмяФайлаСФ()}"",
|                ""Имя"": ""Файл_Имя""
|            },
|            {
|                ""Значение"": ""Документ.СчетФактураВыданный"",
|                ""Имя"": ""Документ""
|            },
|            {
|                ""Значение"": ""[Документ].ВидСчетаФактуры"",
|                ""Имя"": ""ВидСчетаФактуры""
|            },
|            {
|                ""Значение"": ""'Отправитель'"",
|                ""Имя"": ""Отправитель_Роль""
|            },
|            {
|                ""Значение"": ""'Получатель'"",
|                ""Имя"": ""Получатель_Роль""
|            },
|            {
|                ""Значение"": ""'Счет-фактура'"",
|                ""Имя"": ""Документ_Название""
|            },
|            {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Значение"": ""[Документ].Дата"",
|                ""Имя"": ""Документ_Дата""
|            },
|            {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=HH.mm.ss"",
|                ""Значение"": ""[Документ].Дата"",
|                ""Имя"": ""Документ_Время""
|            },
|            {
|                ""Значение"": ""[Документ].Номер"",
|                ""Имя"": ""НомерДокумента""
|            },
|            {
|                ""Значение"": ""{ПолучитьНомерДокумента()}"",
|                ""Имя"": ""Документ_Номер""
|            },
|            {
|                ""Значение"": ""[Документ].Комментарий"",
|                ""Имя"": ""Документ_Примечание""
|            },
|            {
|                ""Значение"": ""[Документ].ДоговорКонтрагента"",
|                ""Имя"": ""Договор""
|            },
|            {
|                ""Значение"": ""[Договор].РасчетыВУсловныхЕдиницах"",
|                ""Имя"": ""ДоговорРасчетыУЕ""
|            },
|            {
|                ""Значение"": ""Константа.ВалютаРегламентированногоУчета"",
|                ""Имя"": ""ВалютаУчета""
|            },
|            {
|                ""Значение"": ""[ВалютаУчета].Код"",
|                ""Имя"": ""ВалютаУчета_КодОКВ""
|            },
|            {
|                ""Значение"": ""[Договор].ВалютаВзаиморасчетов"",
|                ""Имя"": ""Валюта""
|            },
|            {
|                ""Значение"": ""[Валюта].Код"",
|                ""Имя"": ""Валюта_КодОКВ""
|            },
|            {
|                ""Значение"": ""{сбисПересчитатьСФВВалютеУчета()}"",
|                ""Имя"": ""ПересчитатьВВалютеУчета""
|            },
|            {
|                ""Значение"": ""'Истина'"",
|                ""Имя"": ""ЗаполнятьДатуСпособВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].ДатаВыставления"",
|                ""Имя"": ""ДатаВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].КодСпособаВыставления"",
|                ""Вычислить"": ""2"",
|                ""Имя"": ""СпособВыставления""
|            },
|            {
|                ""Значение"": ""[Документ].Ответственный"",
|                ""Имя"": ""ОтветственныйПользователь""
|            },
|            {
|                ""Значение"": ""[ОтветственныйПользователь].ФизическоеЛицо"",
|                ""Имя"": ""Ответственный""
|            },
|            {
|                ""Значение"": ""[Ответственный].ФИО"",
|                ""Имя"": ""Ответственный_ФИО""
|            },
|            {
|                ""Значение"": ""[Ответственный].УникальныйИдентификатор"",
|                ""Имя"": ""Ответственный_Идентификатор""
|            },
|            {
|                ""Значение"": ""[Документ].ДокументОснование"",
|                ""Имя"": ""ДокОснование""
|            },
|            {
|                ""Значение"": ""[ДокОснование].ПодразделениеОрганизации"",
|                ""Имя"": ""Подразделение""
|            },
|            {
|                ""Значение"": ""[Подразделение].Наименование"",
|                ""Имя"": ""Подразделение_Название""
|            },
|            {
|                ""Значение"": ""'Фактура'"",
|                ""Имя"": ""Регламент_Название""
|            },
|            {
|                ""Имя"": ""мПараметр"",
|                ""Значение"": {
|                    ""ДоговорНомер"": [
|                        {
|                            ""Значение"": ""'ДоговорНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ОснованиеДата"": [
|                        {
|                            ""Значение"": ""'ОснованиеДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[ДокОснование].Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ДоговорДата"": [
|                        {
|                            ""Значение"": ""'ДоговорДата'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ],
|                    ""ОснованиеНомер"": [
|                        {
|                            ""Значение"": ""'ОснованиеНомер'"",
|                            ""Имя"": ""Параметр_Имя""
|                        },
|                        {
|                            ""Значение"": ""{сбисНомерОснованияНаПечать()}"",
|                            ""Имя"": ""Параметр_Значение""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мДокументОснование"",
|                ""Значение"": {
|                    ""Договор"": [
|                        {
|                            ""Значение"": ""'ДоговорИсх'"",
|                            ""Имя"": ""ДокументОснование_Тип""
|                        },
|                        {
|                            ""Значение"": ""[Договор].Номер"",
|                            ""Имя"": ""ДокументОснование_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Договор].Дата"",
|                            ""Имя"": ""ДокументОснование_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Тип"": ""ТабличнаяЧасть"",
|                ""Значение"": ""[Документ].ДокументыОснования"",
|                ""Отбор_НомерСтроки"": ""'0'"",
|                ""Имя"": ""ПервоеОснование""
|            },
|            {
|                ""Имя"": ""мСторона"",
|                ""Значение"": {
|                    ""Отправитель"": [
|                        {
|                            ""Значение"": ""[Документ].Организация"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Отправитель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКОПФ"",
|                            ""Имя"": ""Код_ОКОПФ""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКФС"",
|                            ""Имя"": ""Код_ОКФС""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодОКВЭД"",
|                            ""Имя"": ""Код_ОКВЭД""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресОрганизации""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИндивидуальныйПредприниматель"",
|                            ""Имя"": ""ИП""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""АдресФЛ"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[ИП].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].АдресПоПропискеФизическиеЛица""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_АдресФЛ_XML""
|                        },
|                        {
|                            ""Значение"": ""[АдресФЛ].Представление"",
|                            ""Имя"": ""Сторона_АдресФЛ_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Организация"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailОрганизации""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        },
|                        {
|                            ""Имя"": ""Сертификат"",
|                            ""Значение"": ""{сбисПодписант()}"",
|                            ""Кэш"": ""Организация""
|                        },
|                        {
|                            ""Имя"": ""мПредставитель"",
|                            ""Значение"": {
|                                ""Ответственный"": [
|                                    {
|                                        ""Значение"": ""[Сертификат].Должность"",
|                                        ""Имя"": ""Должность""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ФИО"",
|                                        ""Имя"": ""ФИО""
|                                    },
|                                    {
|                                        ""Значение"": ""[Сертификат].ИНН"",
|                                        ""Имя"": ""ИНН""
|                                    }
|                                ]
|                            }
|                        }
|                    ],
|                    ""Получатель"": [
|                        {
|                            ""Значение"": ""[Документ].Контрагент"",
|                            ""Имя"": ""Сторона""
|                        },
|                        {
|                            ""Значение"": ""'Получатель'"",
|                            ""Имя"": ""Роль""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Идентификатор"",
|                            ""Значение"": ""{сбисИдентификаторУчастника()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ИНН"",
|                            ""Имя"": ""Сторона_ИНН""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КПП"",
|                            ""Имя"": ""Сторона_КПП""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].КодПоОКПО"",
|                            ""Имя"": ""Код_ОКПО""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].НаименованиеПолное"",
|                            ""Имя"": ""Сторона_Наименование""
|                        },
|                        {
|                            ""Значение"": ""Справочник.ВидыКонтактнойИнформации"",
|                            ""Имя"": ""ВидыКонтактнойИнформации""
|                        },
|                        {
|                            ""Значение"": ""Перечисление.ТипыКонтактнойИнформации"",
|                            ""Имя"": ""ТипыКонтактнойИнформации""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Адрес"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Адрес"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ЮрАдресКонтрагента""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].ЗначенияПолей"",
|                            ""Имя"": ""Сторона_Адрес_XML""
|                        },
|                        {
|                            ""Значение"": ""[Адрес].Представление"",
|                            ""Имя"": ""Сторона_Адрес_Представление""
|                        },
|                        {
|                            ""Имя"": ""Сторона_Адрес"",
|                            ""Значение"": ""{ПолучитьАдресУП()}"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Телефон"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Телефон"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ТелефонКонтрагента""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Телефон"",
|                            ""Значение"": ""[Телефон].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""Факс"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].Факс"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].ФаксКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_Факс"",
|                            ""Значение"": ""[Факс].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Имя"": ""ЭлПочта"",
|                            ""Кэш"": ""Получатель"",
|                            ""Отбор_Тип"": ""[ТипыКонтактнойИнформации].АдресЭлектроннойПочты"",
|                            ""Значение"": ""[Сторона].КонтактнаяИнформация"",
|                            ""Отбор_Вид"": ""[ВидыКонтактнойИнформации].EmailКонтрагенты""
|                        },
|                        {
|                            ""Имя"": ""Контакт_EMAIL"",
|                            ""Значение"": ""[ЭлПочта].Представление"",
|                            ""Кэш"": ""Получатель""
|                        },
|                        {
|                            ""Значение"": ""[Сторона].ОсновнойБанковскийСчет"",
|                            ""Имя"": ""БанкСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].Банк"",
|                            ""Имя"": ""Банк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Наименование"",
|                            ""Имя"": ""БанкРекв_НаимБанк""
|                        },
|                        {
|                            ""Значение"": ""[Банк].Код"",
|                            ""Имя"": ""БанкРекв_БИК""
|                        },
|                        {
|                            ""Значение"": ""[Банк].КоррСчет"",
|                            ""Имя"": ""БанкРекв_КСчет""
|                        },
|                        {
|                            ""Значение"": ""[БанкСчет].НомерСчета"",
|                            ""Имя"": ""БанкРекв_РСчет""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мОснование"",
|                ""Значение"": {
|                    ""СчФ"": [
|                        {
|                            ""Значение"": ""'СчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Документ].ДатаИсходногоДокумента"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""КСчФ"": [
|                        {
|                            ""Значение"": ""'КСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсправляемогоКорректировочногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Документ].ДатаИсправляемогоКорректировочногоДокумента"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ПРД"": [
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Значение"": ""[Документ].ПлатежноРасчетныеДокументы"",
|                            ""Имя"": ""Основание""
|                        },
|                        {
|                            ""Значение"": ""'ПРД'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Основание].НомерДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Основание].ДатаДокумента"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ИспрИсхСчФ"": [
|                        {
|                            ""Значение"": ""'ИспрИсхСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].НомерИсправленияИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[ПервоеОснование].ДатаИсправленияИсходногоДокумента"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ИсхСчФ"": [
|                        {
|                            ""Значение"": ""'ИсхСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[ПервоеОснование].НомерИсходногоДокумента"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[ПервоеОснование].ДатаИсходногоДокумента"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ],
|                    ""ИспрСчФ"": [
|                        {
|                            ""Значение"": ""'ИспрСчФ'"",
|                            ""Имя"": ""Основание_Название""
|                        },
|                        {
|                            ""Значение"": ""[Документ].НомерИсправления"",
|                            ""Имя"": ""Основание_Номер""
|                        },
|                        {
|                            ""Тип"": ""Дата"",
|                            ""Формат"": ""ДФ=dd.MM.yyyy"",
|                            ""Значение"": ""[Документ].Дата"",
|                            ""Имя"": ""Основание_Дата""
|                        }
|                    ]
|                }
|            },
|            {
|                ""Имя"": ""мТаблДок"",
|                ""Значение"": {
|                    ""СвязанныеДокументы"": [
|                        {
|                            ""Тип"": ""ТабличнаяЧасть"",
|                            ""Значение"": ""[Документ].ДокументыОснования"",
|                            ""Имя"": ""ТаблДок""
|                        },
|                        {
|                            ""Значение"": ""[ТаблДок].ДокументОснование"",
|                            ""Имя"": ""ТаблДок_ДокументОснование""
|                        }
|                    ]
|                }
|            }
|        ]
|    },
|    ""РеестрСБИС_Тип"": {
|        ""Значение"": ""'ФактураИсх,ДокОтгрИсх,Исходящие'""
|    },
|    ""Реестр1С_Название"": {
|        ""Значение"": ""'Счет-фактура выданный'""
|    },
|    ""СписокДокументов"": {
|        ""Данные"": {
|            ""Время"": {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=HH:mm"",
|                ""Значение"": ""'Дата'"",
|                ""Имя"": ""Время""
|            },
|            ""Организация"": {
|                ""Значение"": ""'Организация'"",
|                ""Имя"": ""Организация""
|            },
|            ""Идентификатор"": {
|                ""Значение"": ""'Ссылка'"",
|                ""Имя"": ""Идентификатор""
|            },
|            ""Комментарий"": {
|                ""Значение"": ""'Комментарий'"",
|                ""Имя"": ""Комментарий""
|            },
|            ""Дата"": {
|                ""Тип"": ""Дата"",
|                ""Формат"": ""ДФ=dd.MM.yyyy"",
|                ""Значение"": ""'Дата'"",
|                ""Имя"": ""Дата""
|            },
|            ""Валюта"": {
|                ""Значение"": ""'ВалютаДокумента'"",
|                ""Имя"": ""Валюта""
|            },
|            ""Контрагент"": {
|                ""Значение"": ""'Контрагент'"",
|                ""Имя"": ""Контрагент""
|            },
|            ""Номер"": {
|                ""Значение"": ""'Номер'"",
|                ""Имя"": ""Номер""
|            },
|            ""Сумма"": {
|                ""Значение"": ""'СуммаДокумента'"",
|                ""Имя"": ""Сумма""
|            },
|            ""Название"": {
|                ""Значение"": ""'Ссылка'"",
|                ""Имя"": ""Название""
|            }
|        }
|    },
|    ""Реестр1С_ВидимыеСтолбцы"": {
|        ""Значение"": ""'Отмечен,Проведен,Статус,Дата,Номер,Контрагент,Сумма,Организация,Комментарий,Склад'""
|    },
|    ""ЗапросСпискаДокументов"": {
|        ""Значение"": ""'ВЫБРАТЬ РАЗРЕШЕННЫЕ\n        СчетФактураВыданный.Ссылка,\n\t\tСчетФактураВыданный.Проведен,\n\t\tСчетФактураВыданный.ПометкаУдаления,\n        СчетФактураВыданный.Дата,\n        СчетФактураВыданный.Номер,\n        СчетФактураВыданный.Контрагент.Наименование КАК Контрагент,\n        СчетФактураВыданный.Организация.Наименование КАК Организация,\n\t\tСчетФактураВыданный.Ответственный.Наименование КАК Ответственный,\n        ВЫРАЗИТЬ(СчетФактураВыданный.Комментарий КАК СТРОКА(1000)) КАК Комментарий,\n        СчетФактураВыданный.СуммаДокумента,\n\t\tСчетФактураВыданный.ВалютаДокумента.Наименование КАК Валюта\n        ПОМЕСТИТЬ ВТ_Реализация\n        ИЗ\n        Документ.СчетФактураВыданный КАК СчетФактураВыданный\n\tЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов\n        ПО СчетФактураВыданный.Контрагент = ЗначенияСвойствОбъектов.Объект И ЗначенияСвойствОбъектов.Свойство.Наименование = \""СБИС_СпособДоставки\""\n        ГДЕ\n        ((СчетФактураВыданный.Дата МЕЖДУ &ДатаНач И &ДатаКон) ИЛИ (НЕ &ЗначениеДатаКонЗаполнено И СчетФактураВыданный.Дата > &ДатаНач))\n        И ((СчетФактураВыданный.Контрагент = &Контрагент) ИЛИ (СчетФактураВыданный.Контрагент В Иерархии(&Контрагент)) ИЛИ (НЕ &ЗначениеКонтрагентЗаполнено))\n        И ((СчетФактураВыданный.Организация = &ТекущаяОрганизация) ИЛИ (НЕ &ЗначениеТекущаяОрганизацияЗаполнено))\n\tИ ((СчетФактураВыданный.Ссылка = &ТекущийДокумент)  ИЛИ (НЕ &ЗначениеТекущийДокументЗаполнено))\n\tИ (НЕ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))\n\tИ (&КонтрагентПодключен=\""\"" ИЛИ &КонтрагентПодключен=ЗначенияСвойствОбъектов.Значение.Наименование)\n\tИ (&Ответственный=Значение(Справочник.Пользователи.ПустаяСсылка) ИЛИ &Ответственный=СчетФактураВыданный.Ответственный)\n\tИ НЕ СчетФактураВыданный.ПометкаУдаления;\n        ВЫБРАТЬ\n        ВТ_Реализация.Ссылка КАК Документ,\n\t\tВТ_Реализация.Проведен КАК ДокументПроведен,\n\t\tВТ_Реализация.ПометкаУдаления КАК ДокументПометкаУдаления,\n        ВТ_Реализация.Дата КАК ДатаДокумента,\n        ВТ_Реализация.Номер КАК НомерДокумента,\n        ВТ_Реализация.Контрагент КАК Контрагент,\n        ВТ_Реализация.Организация КАК Организация,\n\t\tВТ_Реализация.Ответственный КАК Ответственный,\n        ВТ_Реализация.Комментарий КАК Комментарий,\n        NULL КАК Склад,\n        ВТ_Реализация.СуммаДокумента КАК СуммаДокумента,\n\t\tВТ_Реализация.Валюта КАК Валюта,\n        NULL КАК Приложение,\n        ДополнительныеСведения.Значение КАК СтатусЭД\n        ИЗ\n        ВТ_Реализация\n        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения\n        ПО ВТ_Реализация.Ссылка = ДополнительныеСведения.Объект И ДополнительныеСведения.Свойство.Наименование = \""ДокументСБИС_Статус\""\n        УПОРЯДОЧИТЬ ПО\n        ДатаДокумента, НомерДокумента'""
|    }
|}}";
	СБИСПлагинИни = Кэш.РаботаСJSON.сбисПрочитатьJSON(СБИСПлагинИни);
	Кэш.Вставить("СБИСПлагинИни", СБИСПлагинИни);
КонецФункции
&НаКлиенте
Функция сбисСообщитьОбОшибке(Кэш, Error) Экспорт
	Ошибка = сбисПолучитьСтруктуруОшибки(Кэш, Error);
	ТекстОшибки = Ошибка.message + " ("+Ошибка.details+")";
	
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Сообщить(ТекстОшибки);
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
	Иначе
		фрм =ЭтотОбъект.ПолучитьФорму("ФормаОшибка");
		фрм.ТекстОшибки = ТекстОшибки;
		фрм.ИнформацияОбОшибке = "";
		фрм.ОткрытьМодально(60);
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция ДобавитьОшибкуВРезультатОтправки(Кэш, Error, Элемент) Экспорт
	Кэш.РезультатОтправки.Ошибок = Кэш.РезультатОтправки.Ошибок + 1;
	Ошибка = сбисПолучитьСтруктуруОшибки(Кэш, Error);
	ТекстОшибки = Ошибка.message;
	ОписаниеРасширенное = Ошибка.details;
	
	ЭлементСписка = Кэш.РезультатОтправки.ТипыОшибок.НайтиПоЗначению(ТекстОшибки);
	Если ЭлементСписка=Неопределено Тогда
		Кэш.РезультатОтправки.ТипыОшибок.Добавить(ТекстОшибки, 1);
	Иначе
		ЭлементСписка.Представление = Число(ЭлементСписка.Представление)+1;
	КонецЕсли;
	ЭлементСоответствия = Кэш.РезультатОтправки.ДетализацияОшибок.Получить(ТекстОшибки);
	Если ЭлементСоответствия=Неопределено Тогда
		СписокДокументов1С = Новый СписокЗначений;
		СписокДокументов1С.Добавить(Элемент.ОсновнойДокумент1С,ОписаниеРасширенное);
		Кэш.РезультатОтправки.ДетализацияОшибок.Вставить(ТекстОшибки, СписокДокументов1С);
	Иначе
		ЭлементСоответствия.Добавить(Элемент.ОсновнойДокумент1С,ОписаниеРасширенное);
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция сбисПолучитьСтруктуруОшибки(Кэш, Error)
	Попытка
		Если Лев(Error,1) = "{" Тогда
			Ошибка = Кэш.РаботаСJSON.сбисПрочитатьJSON(Error);
			Если Ошибка.Свойство("message") и Ошибка.Свойство("detail") Тогда
				ТекстОшибки = Ошибка.message;
				ОписаниеРасширенное = Ошибка.detail;
			Иначе
				ТекстОшибки = Ошибка.error.message;
				ОписаниеРасширенное = Ошибка.error.details;
			КонецЕсли;
		ИначеЕсли Лев(Error,35) = "callBLObject(): Метод бизнес логики" и Найти(Error,"вернул ошибку")>0 Тогда
			ErrorJson = Сред(Error, Найти(Error,"{"));
			ErrorJson = Лев(ErrorJson, СтрДлина(ErrorJson)-1);
			Ошибка = Кэш.РаботаСJSON.сбисПрочитатьJSON(ErrorJson);
			Попытка
				ТекстОшибки = Ошибка.message;
				ОписаниеРасширенное = Ошибка.details;
			Исключение
				ТекстОшибки = Error;
				ОписаниеРасширенное = Error;
			КонецПопытки;
		ИначеЕсли Найти(Error,"{""jsonrpc"":") >0 Тогда
			ErrorJson = Сред(Error, Найти(Error,"{""jsonrpc"":"));
			Пока Прав(ErrorJson,1) <> "}" Цикл
				ErrorJson = Лев(ErrorJson, СтрДлина(ErrorJson)-1);		
			КонецЦикла;
			Ошибка = Кэш.РаботаСJSON.сбисПрочитатьJSON(ErrorJson);
			Попытка
				ТекстОшибки = Ошибка.message;
				ОписаниеРасширенное = Ошибка.details; 
			Исключение
				Попытка
					ТекстОшибки = Ошибка.Error.message;
					ОписаниеРасширенное = Ошибка.Error.details; 
				Исключение
					ТекстОшибки = Error;
					ОписаниеРасширенное = Error;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ТекстОшибки = Error;
			ОписаниеРасширенное = Error;
		КонецЕсли;
	Исключение
		ТекстОшибки = Error;
		ОписаниеРасширенное = Error;
	КонецПопытки;
	
	Ошибка = Новый Структура("message,details",ТекстОшибки,ОписаниеРасширенное);
	Возврат Ошибка;
КонецФункции
