&НаКлиенте
Перем Кэш;

//функция обновляет контент для подразделов раздела Справочники	
&НаКлиенте
Функция ОбновитьКонтент(ЛокальныйКэш) Экспорт
	//СтруктураДляОбновленияФормы = Кэш.ОбщиеФункции.сбисОбновитьРеестрДокументов1С(Ини, Кэш);
	Кэш = ЛокальныйКэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ИмяРеестра = "";
	ИмяРаздела = "Справочники";
	Ини = "";
	Если Не Кэш.Разделы[ИмяРаздела].Свойство(Кэш.Текущий.Имя, ИмяРеестра) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	//Снимем видимость у панелей, не принадлежащих текущему разделу
	СтраницыПанели = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш,, ИмяРаздела + "_Подразделы");
	СтраницыПанели.ТекущаяСтраница = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш, СтраницыПанели, "Неопределено");
	
	фрм = ГлавноеОкно.сбисНайтиФормуФункции("ОбновитьКонтент","Раздел_" + ИмяРаздела + "_" + ИмяРеестра,, Кэш);
	Если Не фрм = Ложь Тогда
		Возврат фрм.ОбновитьКонтент(ЛокальныйКэш);
	КонецЕсли;

	Если Не Кэш.Ини.Свойство(ИмяРеестра,Ини) Тогда
		Возврат Ложь;
	ИначеЕсли Ини = Неопределено Тогда
		Ини = Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра);
	КонецЕсли;
	Кэш.Текущий.ТипДок = ИмяРеестра;
	
	Контент					= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Контент");
	ПанельМассовыхОпераций	= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельМассовыхОпераций");
	Кэш.ТаблДок				= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Таблица_РеестрСправочников");
	Контент.ТекущаяСтраница	= ГлавноеОкно.сбисПолучитьСтраницу(Контент, "РеестрСправочников");	
	
	НаСменуРаздела(Кэш);//Вызываем руками, чтобы изменилась панель операций.

	ГлавноеОкно.сбисЗаполнитьСписокСправочника(Кэш.ФормаНастроек.Ини(Кэш, ИмяРеестра));
КонецФункции
&НаКлиенте
Процедура НастроитьКолонки(Кэш) Экспорт
КонецПроцедуры
//Процедура устанавливает панель навигации на 1ую страницу и скрывает панель	
&НаКлиенте
Процедура НавигацияУстановитьПанель(ЛокальныйКэш=Неопределено) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельНавигации").Видимость		= Ложь;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость	= Ложь;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице").Видимость	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НаСменуРаздела(ЛокальныйКэш) Экспорт
	Кэш = ЛокальныйКэш;
	ПанельМассовыхОпераций = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельМассовыхОпераций");
	Попытка
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники" + Кэш.Текущий.ТипДок);
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельТулбар").Видимость = Истина;
	Исключение
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники");
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельТулбар").Видимость = Истина;
	КонецПопытки;	
	ТекущийИмя	= Кэш.Текущий.Имя;
	РодительИмя	= Кэш.Текущий.ПредыдущийРаздел.ТипДок;
	КнопкаИмя = "СправочникиОтправить";
	Кэш.ГлавноеОкно.сбисОчиститьПанельКнопок(Новый Структура("Имя, УправляемоеПриложение", КнопкаИмя, Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение), Ложь);
	
	сбисРазделМеню = Кэш.МенюРазделов;
	//Заполним команды из инишек и стандартные
	Если	сбисРазделМеню.Свойство(РодительИмя,	сбисРазделМеню)
		И	сбисРазделМеню.Свойство(ТекущийИмя,		сбисРазделМеню) Тогда
		ДобавитьКнопки = Новый Массив;
		//Проверим, не переназначены ли стандартные команды через ини
		Для Каждого Пункт Из сбисРазделМеню Цикл
			Для сч = 0 По ДобавитьКнопки.Количество()-1 Цикл
				Если ДобавитьКнопки[сч]["ИмяКнопки"] = Пункт["ИмяКнопки"] Тогда
					ДобавитьКнопки.Удалить(сч);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Для Каждого КнопкаДобавить Из ДобавитьКнопки Цикл
			сбисРазделМеню.Добавить(КнопкаДобавить);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	//Добавим кнопки в Отправить
	Для Каждого Пункт Из сбисРазделМеню Цикл
		Если Не ЗначениеЗаполнено(Пункт.МетодАктивации) Тогда
			Продолжить;
		КонецЕсли;
		Отказ			= Ложь;
		ПараметрыКнопки = Новый Структура(
			"Имя,				Заголовок,																		Панель,					УправляемоеПриложение", 
			Пункт.ИмяКнопки,	?(Пункт.Свойство("ЗаголовокКнопки"), Пункт.ЗаголовокКнопки, Пункт.ИмяКнопки),	КнопкаИмя,	Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение);
		РезультатФормированияКнопки = Кэш.ГлавноеОкно.сбисДобавитьКнопку(ПараметрыКнопки, Отказ);
		Если Отказ Тогда
			Кэш.ГлавноеОкно.сбисСообщитьОбОшибке(Кэш, РезультатФормированияКнопки);
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры