&НаКлиенте
Функция Показать(Кэш, СтруктураПараметров) Экспорт
	ПараметрыЗаполнения = Новый Структура("УправляемоеПриложение, Параметры", Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение, СтруктураПараметров);
	ЗаполнитьДанныеФормы(ПараметрыЗаполнения, Ложь);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ЭтаФорма.ОткрытьМодально();
	#Иначе
		Открыть();
	#КонецЕсли
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(ПараметрыЗаполнения, Отказ)
	ПутьКЭлементам = "ЭлементыФормы";
	Если ПараметрыЗаполнения.УправляемоеПриложение Тогда
		ПутьКЭлементам = "Элементы";
	КонецЕсли;
	ЭтаФорма[ПутьКЭлементам].Сумма1С.Заголовок				= ПараметрыЗаполнения.Параметры.СуммаДокументов1С;
	ЭтаФорма[ПутьКЭлементам].СуммаСБИС.Заголовок			= ПараметрыЗаполнения.Параметры.СуммаДокументовСБИС;
	ЭтаФорма[ПутьКЭлементам].Дельта.Заголовок				= ПараметрыЗаполнения.Параметры.Дельта;
	ЭтаФорма[ПутьКЭлементам].ТочноеСовпадение.Заголовок		= ПараметрыЗаполнения.Параметры.ОднозначноСопоставлено;
	ЭтаФорма[ПутьКЭлементам].НесколькоСовпадений.Заголовок	= ПараметрыЗаполнения.Параметры.НеоднозначноСопоставлено;
	ЭтаФорма[ПутьКЭлементам].НеНайдено.Заголовок			= ПараметрыЗаполнения.Параметры.НеНайденоПодходящих;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНажатие(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
