&НаКлиенте
Функция ПрочитатьДокумент(Кэш,Контекст) Экспорт
	фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПрочитатьДокумент","Документ_Шаблон", "",Кэш);
	ВсеВыгрузилось = фрм.ПрочитатьДокумент(Кэш,Контекст);
		
	// Формируем пакеты со счетами-фактурами поставщикам
	Если Кэш.ини.Свойство("СчетФактураВыданныйПоставщику") Тогда
		ТаблДокПоставщики = Контекст.ДокументДанные.мФайл.ОтчКмт.мТаблДок.Поставщики;
		Для Каждого Стр Из ТаблДокПоставщики Цикл
			Если ЗначениеЗаполнено(Стр.ИсхСФ) Тогда
				ЗначениеИниСчетФактуры = Кэш.ФормаНастроек.Ини(Кэш, "СчетФактураВыданныйПоставщику");
				ЗначениеИниСчетФактуры.Вставить("Формат2016", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
				ЗначениеИниСчетФактуры.Вставить("Формат2019", Новый Структура("Значение,РассчитанноеЗначение", Истина, Истина));
				Контекст.Вставить("ДокументДанные", Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(ЗначениеИниСчетФактуры, Стр.ИсхСФ, Кэш.КэшЗначенийИни, Кэш.Парам));  // alo Меркурий
				// Нужно выбрать только строки с товарами, у которых ключ строки совпадает с ключом текущей строки таб части Поставщики
				Товары = Новый Массив;
				КолТоваров = 0;
				УказанТипНоменклатуры = Ложь;
				Для Каждого Элемент Из Контекст.ДокументДанные.мФайл.СчФктр.мТаблДок.Товары Цикл
					Если Элемент.КлючСтроки = Стр.ТаблДок_Идентификатор Тогда	
						Товары.Добавить(Элемент);
						Если Элемент.Свойство("ТаблДок_Тип") Тогда
							УказанТипНоменклатуры = Истина;
							Если Элемент.ТаблДок_Тип = "1" Тогда
								КолТоваров = КолТоваров+1;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если УказанТипНоменклатуры и КолТоваров=0 Тогда
					Если Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Свойство("Грузополучатель") 
						и Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Свойство("Роль") 
						и Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Роль = "Грузополучатель" Тогда
						Контекст.ДокументДанные.мФайл.СчФктр.мСторона.Грузополучатель.Роль = "Организация";
						Если Контекст.ДокументДанные.мФайл.СчФктр.Отправитель_Роль = "Грузополучатель" Тогда
							Контекст.ДокументДанные.мФайл.СчФктр.Отправитель_Роль = "Организация";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Кэш.КэшЗначенийИни.ТекущийПакет.Очистить();
				Контекст.ДокументДанные.мФайл.СчФктр.мТаблДок.Товары = Товары;
				Контекст.Вставить("СоставПакета",Новый Структура);
				Контекст.СоставПакета.Вставить("Вложение",Новый Массив);
				Контекст.Вставить("ФайлДанные", Новый Структура);
				Контекст.Вставить("Документ",  Стр.ИсхСФ);


				Для Каждого Файл Из Контекст.ДокументДанные.мФайл Цикл
					Файл = Файл.Значение;
					Контекст.ФайлДанные = Файл;
					Файл.Файл_Формат = Кэш.ОбщиеФункции.РассчитатьЗначение("Файл_Формат", Файл, Кэш);
					Файл_Формат = Файл.Файл_Формат;
					Файл_ВерсияФормата = СтрЗаменить(Файл.Файл_ВерсияФормата,".","_");
					фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьДанныеИзДокумента1С","Файл_Шаблон","Файл_Шаблон",Кэш);			
					Если Не фрм.ПолучитьДанныеИзДокумента1С(Кэш,Контекст) Тогда //если хотябы что-то не выгрузилось - отбой
						ВсеВыгрузилось = Ложь;
					КонецЕсли;
				КонецЦикла;
				ИмяДокумента = Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Контекст.Документ, "Имя");
				Контекст.СоставПакета.Вставить("ПользовательскийИдентификатор", ИмяДокумента+":"+строка(Контекст.Документ.УникальныйИдентификатор()));
				Контекст.МассивПакетов.Добавить(Контекст.СоставПакета);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ВсеВыгрузилось;
КонецФункции
&НаКлиенте
Функция ПрочитатьТабличнуюЧасть(Кэш,Контекст) Экспорт
	ВсеВыгрузилось = Истина;
	//Для Каждого Файл Из Контекст.ДокументДанные.мФайл Цикл
		Файл = Контекст.ДокументДанные.мФайл.АктВР;   // В СФ должна идти только табличная часть акта
		Контекст.ФайлДанные = Файл;
		Файл.Файл_Формат = Кэш.ОбщиеФункции.РассчитатьЗначение("Файл_Формат", Файл, Кэш);
		Файл_Формат = Файл.Файл_Формат;
		Файл_ВерсияФормата = СтрЗаменить(Файл.Файл_ВерсияФормата,".","_");
		фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("ПолучитьТабличнуюЧастьДокумента1С","Файл_"+Файл_Формат+"_"+Файл_ВерсияФормата,"Файл_Шаблон",Кэш);			
		фрм.ПолучитьТабличнуюЧастьДокумента1С(Кэш,Контекст);
	//КонецЦикла;
	Возврат ВсеВыгрузилось;
КонецФункции
