
&НаКлиенте
Процедура СписокДляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗначениеВыбора	= Элемент.ТекущиеДанные.Значение;
	ЭтаФорма.Закрыть(ЗначениеВыбора);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанныеФормы(Отказ, Параметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(Отказ, ПараметрыЗаполненияФормы)
	ПараметрыЗаполненияФормы.Свойство("СписокДляВыбора", СписокДляВыбора);
	ПараметрыЗаполненияФормы.Свойство("Заголовок", ЭтаФорма.Заголовок);
	//СписокДляВыбора = ПараметрыЗаполненияФормы.СписокДляВыбора;
	//ЭтаФорма.Заголовок = ПараметрыЗаполненияФормы.Заголовок;
КонецПроцедуры

&НаКлиенте
Функция Показать(ПараметрыДиалога) Экспорт
	Если ПараметрыДиалога.Свойство("ПараметрыФормы") Тогда
		ЗаполнитьДанныеФормы(Ложь, ПараметрыДиалога.ПараметрыФормы)
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ЭтаФорма.ОткрытьМодально();
	#Иначе
		ЭтаФорма.Открыть();
	#КонецЕсли
КонецФункции