&НаКлиенте
Перем Кэш;

&НаКлиенте
Процедура Показать(ЛокальныйКэш) Экспорт
	// Функция открывает окно сопоставления документов и заполняет все реквизиты на форме	
	Если ЛокальныйКэш.ТихийРежим Тогда
		Возврат;
	КонецЕсли;
	ТекстЗапроса = "";
	Если ЛокальныйКэш.Ини.Конфигурация.Свойство("ЗапросПрофилейПользователей") Тогда
		ТекстЗапроса = СокрЛП(ЛокальныйКэш.Ини.Конфигурация.ЗапросПрофилейПользователей.Значение);
	КонецЕсли;
	Рез = ЗаполнитьДанныеФормы(ТекстЗапроса);
	Если Рез Тогда	
		Открыть();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура СохранитьДанныеАвторизацииНаСервере()
	// Вставить содержимое обработчика.
	Попытка
		Профили = ПрофилиПользователей.Выгрузить(Новый Структура("Отмечен", Истина), "Наименование");
		
		ХранилищеОбщихНастроек.Сохранить("СБИС", "Авторизация", Новый Структура("Логин,Пароль,ИДПриложения,КлючПриложения,КлючАутентификации,Профили",Логин, Пароль, ИДПриложения, КлючПриложения, КлючАутентификации, Профили),,"ПользовательСБИС");
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеАвторизации(Команда)
	СохранитьДанныеАвторизацииНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеФормы(ТекстЗапроса)
	Попытка
		Настройки = ХранилищеОбщихНастроек.Загрузить("СБИС", "Авторизация",,"ПользовательСБИС");
		Если Настройки <> Неопределено Тогда
			Логин = Настройки.Логин;
			Пароль = Настройки.Пароль;
			Если Настройки.Свойство("Профили") Тогда
				ОтмеченныеПрофили = Настройки.Профили;
				ОтмеченныеПрофили = ОтмеченныеПрофили.ВыгрузитьКолонку("Наименование");
			КонецЕсли;
			Если Настройки.Свойство("ИДПриложения") Тогда
				ИДПриложения = Настройки.ИДПриложения;
				КлючПриложения = Настройки.КлючПриложения;
				КлючАутентификации = Настройки.КлючАутентификации;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Ложь КАК Отмечен", "ВЫБОР КОГДА Профили.Наименование В (&ОтмеченныеПрофили) Тогда Истина ИНАЧЕ Ложь КОНЕЦ КАК Отмечен");
			Запрос = Новый Запрос(Сред(ТекстЗапроса,2,СтрДлина(ТекстЗапроса)-2));
			Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
			Профили = РеквизитФормыВЗначение("ПрофилиПользователей"); // заполняем ПрофилиПользователей 
			Профили = Запрос.Выполнить().Выгрузить();
			ЗначениеВРеквизитФормы(Профили, "ПрофилиПользователей");
		КонецЕсли;
		Если Профили.Найти( Ложь, "Отмечен") = Неопределено Тогда
			ОтметитьВсе = Истина;
		Иначе
			ОтметитьВсе = Ложь;
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		Если Найти(Ошибка, "Нарушение прав доступа") Тогда
			Сообщить("Функционал доступен только администратору системы!");
			Возврат Ложь;
		КонецЕсли;
		Сообщить(Ошибка);
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	// отмечает все записи в таблице	
	ОтметитьВсе = Не ОтметитьВсе;
	Для Каждого Строка Из ПрофилиПользователей Цикл
		Строка.Отмечен = ОтметитьВсе;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КакНастроитьНажатие(Элемент)
	ЗапуститьПриложение("https://sbis.ru/help/integration/app/add_app");
КонецПроцедуры
