&НаКлиенте
Функция сбисПолучитьФорму(ИмяФормы)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Возврат ПолучитьФорму("ВнешняяОбработка.СБИС.Форма."+ИмяФормы);
	КонецЕсли;
	Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
КонецФункции

&НаКлиенте
Функция СоздатьДокумент(Кэш, Вложение, ИниДок, СоставПакета, МассивОснований, Документ1С = Неопределено) Экспорт
// Функция ищет документ-основание СФ (в случае, если СФ пришел один), загружает СФ
	Если МассивОснований.Количество()=0 тогда   // пришел один СФ
		ФорматВерсияФайла = Вложение.СтруктураФайла.Файл.Формат+"_"+СтрЗаменить(СтрЗаменить(Вложение.СтруктураФайла.Файл.ВерсияФормата,".", "_"), " ", "");
		Ини = Кэш.ОбщиеФункции.сбисОпределитьИниДляЗагрузки(Кэш, Вложение, ФорматВерсияФайла);
		Аванс = Ложь;
		Если Вложение.СтруктураФайла.Файл.Свойство("Документ") и Вложение.СтруктураФайла.Файл.Документ.Свойство("Параметр") и Вложение.СтруктураФайла.Файл.Документ.Параметр.Свойство("ИдВизуализации") и Найти(нрег(Вложение.СтруктураФайла.Файл.Документ.Параметр.ИдВизуализации), "аванс")>0 Тогда
			Аванс = Истина;
		КонецЕсли;
		Если ИниДок.Свойство("мОснование") и Не Аванс Тогда   // перебираем основания в инишке фактуры
			Для каждого Основание Из ИниДок.мОснование Цикл
				Если Основание.Значение.Свойство("Основание_Документ") и Основание.Значение.Основание_Документ.Свойство("Тип") Тогда
					Попытка
						ТипыОснований = Новый ОписаниеТипов(Основание.Значение.Основание_Документ.Тип);
						ДокументПоступления = Неопределено;
						ИниПервогоОснования = Неопределено;
						СписокДокументов = Новый СписокЗначений;
						сч = 1;
						Для Каждого РазделДок Из Ини.мДокумент Цикл   // Ищем в инишке фактуры мДокумент с типом, который может быть основанием СФ
							ТипМДок = Сред(РазделДок.Значение.Документ.Значение, Найти(РазделДок.Значение.Документ.Значение, ".")+1);
							Если ТипыОснований.СодержитТип(Тип("ДокументСсылка."+ТипМДок)) Тогда	
								ИниПост = РазделДок.Значение;
								Если сч = 1 Тогда
									ИниПервогоОснования = РазделДок.Значение;
								КонецЕсли;
								сч = сч + 1; 
	                            фрм = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("СоздатьДокумент","Документ_"+РазделДок.Ключ,"Документ_Шаблон",Кэш);
								ТекущийДокументПоступления = Кэш.ОбщиеФункции.сбисВыбратьПодходящийДокумент(Вложение.Документы1С,РазделДок.Ключ);  // уже есть связанный документ поступления
								
								Если Не ЗначениеЗаполнено(ТекущийДокументПоступления) Тогда  // если нет связанного документа поступления, пытаемся найти его по реквизитам основания из СФ
									РеквизитыДляПоиска = Новый Структура;
									РеквизитыДляПоиска.Вставить("НашаОрганизация", СоставПакета.НашаОрганизация);
									РеквизитыДляПоиска.Вставить("Контрагент", СоставПакета.Контрагент);
									Если ИниПост.Свойство("Документ_ДатаВх") Тогда
										Если ИниПост.Документ_ДатаВх.Свойство("Данные") Тогда
											ДатаПост = Кэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ИниПост.Документ_ДатаВх.Данные, Вложение.СтруктураФайла);
										ИначеЕсли Вложение.СтруктураФайла.Свойство("Файл") И Вложение.СтруктураФайла.Файл.Свойство("Документ") И Вложение.СтруктураФайла.Файл.Документ.Свойство("Параметр") И Вложение.СтруктураФайла.Файл.Документ.Параметр.Свойство("ОснованиеДата") Тогда
											ДатаПост = Вложение.СтруктураФайла.Файл.Документ.Параметр.ОснованиеДата;
										ИначеЕсли Вложение.СтруктураФайла.Свойство("Файл") И Вложение.СтруктураФайла.Файл.Свойство("Документ") И Вложение.СтруктураФайла.Файл.Документ.Свойство("Дата") Тогда
											ДатаПост = Вложение.СтруктураФайла.Файл.Документ.Дата;
										КонецЕсли;	
										Попытка
											ДатаПост = Дата(Сред(ДатаПост,7,4),Сред(ДатаПост,4,2),Лев(ДатаПост,2));
											РеквизитыДляПоиска.Вставить("Дата", ДатаПост);
										Исключение
										КонецПопытки;
									КонецЕсли;
									Если ИниПост.Свойство("Документ_НомерВх") Тогда
										Если ИниПост.Документ_НомерВх.Свойство("Данные") Тогда
											НомерПост = Кэш.ОбщиеФункции.РассчитатьЗначениеИзСтруктуры(ИниПост.Документ_НомерВх.Данные, Вложение.СтруктураФайла);
										ИначеЕсли Вложение.СтруктураФайла.Свойство("Файл") И Вложение.СтруктураФайла.Файл.Свойство("Документ") И Вложение.СтруктураФайла.Файл.Документ.Свойство("Параметр") И Вложение.СтруктураФайла.Файл.Документ.Параметр.Свойство("ОснованиеНомер") Тогда
											НомерПост = Вложение.СтруктураФайла.Файл.Документ.Параметр.ОснованиеНомер;
										ИначеЕсли Вложение.СтруктураФайла.Свойство("Файл") И Вложение.СтруктураФайла.Файл.Свойство("Документ") И Вложение.СтруктураФайла.Файл.Документ.Свойство("Номер") Тогда
											НомерПост = Вложение.СтруктураФайла.Файл.Документ.Номер;
										КонецЕсли;
										Если ЗначениеЗаполнено(НомерПост) Тогда
											РеквизитыДляПоиска.Вставить("Номер", НомерПост);
										КонецЕсли;
									КонецЕсли;
									Если РеквизитыДляПоиска.Свойство("Дата") и РеквизитыДляПоиска.Свойство("Номер") Тогда
										фрмНайтиДок = Кэш.ГлавноеОкно.сбисНайтиФормуФункции("НайтиПодходящиеДокументыОпределенногоТипа","РаботаСДокументами1С",,Кэш);
										фрмНайтиДок.НайтиПодходящиеДокументыОпределенногоТипа(СписокДокументов, ИниПост, Кэш.Ини, Кэш.Парам, РеквизитыДляПоиска);
									КонецЕсли;										
								КонецЕсли;
								Если СписокДокументов.Количество()>0 Тогда  // если нашли подходящий документ, берем его, иначе создаем новый
									ДокументПоступления	= СписокДокументов[0].Значение;
									ТекстСообщения		= "Найден подходящий документ-основание "+строка(ДокументПоступления);
									ДанныеДозаполнить	= Кэш.ОбщиеФункции.РезультатДействия_ИзвлечьВременныеДанные(Кэш);
									//AU если заполняем детализацию, то не сообщаем сразу.
									Если ДанныеДозаполнить.ЗаполнитьДетализацию Тогда
										ПараметыЗаполнения = Новый Структура("Ссылка, Тип, Состояние, Сообщение", ДокументПоступления, ИниПост.Документ.Значение, "Найден.", ТекстСообщения);
										Кэш.ОбщиеФункции.РезультатДействия_ДобавитьВРасшифровку(Кэш, "ЗагрузкаДокумента", ДанныеДозаполнить.СтрокаДетализации, ПараметыЗаполнения);
									Иначе
										Сообщить("Для документа " + Вложение.Название + " н" + Сред(ТекстСообщения, 2));
									КонецЕсли;
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Если СписокДокументов.Количество()=0 и ЗначениеЗаполнено(ИниПервогоОснования)Тогда  // если не нашли подходящий документ, создаем новый
							//AU если заполнение детализации происходит внутри функции создания документа.
							ДокументПоступления = фрм.СоздатьДокумент(Кэш,Вложение,ИниПервогоОснования,СоставПакета,МассивОснований, ТекущийДокументПоступления);
						КонецЕсли;
						Если ЗначениеЗаполнено(ДокументПоступления) Тогда
							МассивОснований.Добавить(ДокументПоступления);
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат сбисПолучитьФорму("Документ_Шаблон").СоздатьДокумент(Кэш, Вложение, ИниДок, СоставПакета, МассивОснований, Документ1С);
КонецФункции
